[
    {
        "word": "Aloft",
        "part_of_speech": "Adverb / Adjective",
        "definition": "Up in or into the air; overhead.",
        "hindi_meaning": "ऊपर, हवा में",
        "mnemonic": "Aloft sounds like 'a-lift,' as if something is lifted up high into the air.",
        "visual_representation": "Picture a hot air balloon floating high in the sky, symbolizing being aloft.",
        "example_sentence": "The flag was held aloft by the strong winds."
    },
    {
        "word": "Bulwark",
        "part_of_speech": "Noun",
        "definition": "A defensive wall; something serving as a strong defense or protection.",
        "hindi_meaning": "सुरक्षा, किला, रक्षा दीवार",
        "mnemonic": "Bulwark sounds like 'bull-work,' indicating a strong, defensive wall as solid as a bull.",
        "visual_representation": "Picture a strong stone wall protecting a castle, symbolizing a bulwark.",
        "example_sentence": "The soldiers took refuge behind the bulwark during the attack."
    },
    {
        "word": "Clique",
        "part_of_speech": "Noun",
        "definition": "A small group of people with shared interests or other features in common, who spend time together and do not readily allow others to join them.",
        "hindi_meaning": "गिरोह, छोटा समूह",
        "mnemonic": "Clique sounds like 'click,' as in a small group that clicks together but excludes others.",
        "visual_representation": "Picture a tight-knit group of friends sitting together and excluding others, symbolizing a clique.",
        "example_sentence": "The high school was full of different cliques, each with its own interests and activities."
    },
    {
        "word": "Discretion",
        "part_of_speech": "Noun",
        "definition": "The quality of behaving or speaking in such a way as to avoid causing offense or revealing private information; the freedom to decide what should be done in a particular situation.",
        "hindi_meaning": "विवेक, निर्णय करने की स्वतंत्रता",
        "mnemonic": "Discretion sounds like 'discern,' as in the ability to discern the best course of action.",
        "visual_representation": "Picture someone carefully choosing their words in a sensitive conversation, symbolizing discretion.",
        "example_sentence": "She handled the confidential information with great discretion."
    },
    {
        "word": "Euphonious",
        "part_of_speech": "Adjective",
        "definition": "Pleasing to the ear, especially through a harmonious combination of words.",
        "hindi_meaning": "मधुर, सुरीला",
        "mnemonic": "Euphonious sounds like 'eu-pho-nice,' indicating a sound that is nice or pleasant to hear.",
        "visual_representation": "Picture a choir singing a beautiful, harmonious melody, symbolizing something euphonious.",
        "example_sentence": "The euphonious melody of the piano filled the room with a sense of peace."
    },
    {
        "word": "Fulcrum",
        "part_of_speech": "Noun",
        "definition": "The point on which a lever rests or is supported and on which it pivots; a thing that plays a central or essential role in an activity or event.",
        "hindi_meaning": "आधार बिंदु, संतुलन बिंदु",
        "mnemonic": "Fulcrum sounds like 'full-crum,' as in the central point that supports the full movement.",
        "visual_representation": "Picture a seesaw with the central pivot point where the board balances, symbolizing a fulcrum.",
        "example_sentence": "The introduction of the new policy served as the fulcrum for the company's turnaround."
    },
    {
        "word": "Gargantuan",
        "part_of_speech": "Adjective",
        "definition": "Enormous; gigantic.",
        "hindi_meaning": "विशाल, बहुत बड़ा",
        "mnemonic": "Gargantuan sounds like 'gigantic-one,' indicating something extremely large in size.",
        "visual_representation": "Picture a giant boulder towering over a person, symbolizing something gargantuan.",
        "example_sentence": "The restaurant is known for its gargantuan portions that can easily feed two people."
    },
    {
        "word": "Indubitable",
        "part_of_speech": "Adjective",
        "definition": "Impossible to doubt; unquestionable.",
        "hindi_meaning": "निर्विवाद, अटल",
        "mnemonic": "Indubitable sounds like 'in-doubt-able,' as in something that cannot be doubted.",
        "visual_representation": "Picture a judge declaring a verdict with absolute certainty, symbolizing something indubitable.",
        "example_sentence": "The evidence against the defendant was indubitable, leading to a swift conviction."
    },
    {
        "word": "Levity",
        "part_of_speech": "Noun",
        "definition": "Humor or frivolity, especially the treatment of a serious matter with humor or in a manner lacking due respect.",
        "hindi_meaning": "हल्कापन, चंचलता",
        "mnemonic": "Levity sounds like 'levitate-y,' as if lifting the mood or lightening a serious situation.",
        "visual_representation": "Picture someone cracking a joke in a serious meeting, symbolizing levity.",
        "example_sentence": "His levity during the tense negotiation helped ease the atmosphere."
    },
    {
        "word": "Mortician",
        "part_of_speech": "Noun",
        "definition": "A person whose job is to prepare dead bodies for burial or cremation and to arrange funerals.",
        "hindi_meaning": "शवदाहक, अंतिम संस्कार करने वाला",
        "mnemonic": "Mortician sounds like 'mortal-ician,' indicating someone who deals with the mortal remains.",
        "visual_representation": "Picture a somber person arranging flowers and preparing a casket for a funeral, symbolizing a mortician.",
        "example_sentence": "The mortician ensured that everything was in order for the funeral service."
    },
    {
        "word": "Odyssey",
        "part_of_speech": "Noun",
        "definition": "A long, adventurous journey or experience.",
        "hindi_meaning": "दीर्घ यात्रा, साहसिक यात्रा",
        "mnemonic": "Odyssey sounds like 'odd-sea,' as in an adventurous journey across the sea.",
        "visual_representation": "Picture a ship sailing on a long, adventurous voyage through uncharted waters, symbolizing an odyssey.",
        "example_sentence": "Their road trip across the country was an unforgettable odyssey."
    },
    {
        "word": "Placebo",
        "part_of_speech": "Noun",
        "definition": "A harmless pill, medicine, or procedure prescribed more for the psychological benefit to the patient than for any physiological effect.",
        "hindi_meaning": "दिखावटी औषधि, झूठी दवा",
        "mnemonic": "Placebo sounds like 'place-be-o,' as in placing something to see the effect, even if it’s not real.",
        "visual_representation": "Picture a sugar pill being given to a patient who believes it’s real medicine, symbolizing a placebo.",
        "example_sentence": "The patient’s condition improved after taking the placebo, suggesting a strong psychological effect."
    },
    {
        "word": "Resolve",
        "part_of_speech": "Noun / Verb",
        "definition": "(Noun) A firm determination to do something. (Verb) To settle or find a solution to (a problem, dispute, or contentious matter).",
        "hindi_meaning": "संकल्प, दृढ़ निश्चय; हल करना",
        "mnemonic": "Resolve sounds like 're-solve,' as in solving something with determination or making a firm decision.",
        "visual_representation": "Picture someone standing tall and confident, ready to tackle a challenge with determination, symbolizing resolve.",
        "example_sentence": "She showed great resolve in completing the marathon despite the pain."
    },
    {
        "word": "Solder",
        "part_of_speech": "Verb / Noun",
        "definition": "To join or fuse (metallic parts) with a solder (a low-melting alloy); the material used to bond metal parts together.",
        "hindi_meaning": "जोड़ना, मिलाना",
        "mnemonic": "Solder sounds like 'solid-er,' indicating making a solid bond between two metal pieces.",
        "visual_representation": "Picture a craftsman using a soldering iron to fuse two pieces of metal together, symbolizing soldering.",
        "example_sentence": "The technician used solder to repair the broken circuit."
    },
    {
        "word": "Tempo",
        "part_of_speech": "Noun",
        "definition": "The speed at which a passage of music is played or the speed of any activity or process.",
        "hindi_meaning": "गति, ताल",
        "mnemonic": "Tempo sounds like 'temp-o,' indicating the speed or pace of music or an activity.",
        "visual_representation": "Picture a conductor guiding an orchestra to play faster or slower, symbolizing tempo.",
        "example_sentence": "The upbeat tempo of the music kept everyone on the dance floor."
    },
    {
        "word": "Venturesome",
        "part_of_speech": "Adjective",
        "definition": "Willing to take risks or embark on difficult or unusual courses of action.",
        "hindi_meaning": "साहसी, जोखिम उठाने वाला",
        "mnemonic": "Venturesome sounds like 'venture-some,' indicating someone who is ready to venture out into new, risky endeavors.",
        "visual_representation": "Picture an explorer setting off into the unknown, symbolizing a venturesome spirit.",
        "example_sentence": "His venturesome nature led him to start his own business despite the risks."
    }
]
