[
    {
        "word": "Altercation",
        "part_of_speech": "Noun",
        "definition": "A noisy argument or disagreement, especially in public.",
        "hindi_meaning": "झगड़ा, विवाद",
        "mnemonic": "Altercation sounds like 'alter-case-shun,' as if two people are altering their cases or arguments, leading to a heated dispute.",
        "visual_representation": "Picture two people in a heated argument, gesturing wildly and shouting, symbolizing an altercation.",
        "example_sentence": "The altercation between the two drivers caused a traffic jam."
    },
    {
        "word": "Bungalow",
        "part_of_speech": "Noun",
        "definition": "A low house, with a broad front porch, having either no upper floor or upper rooms set in the roof, typically with dormer windows.",
        "hindi_meaning": "एकमंजिला मकान, बंगला",
        "mnemonic": "Bungalow sounds like 'bung-low,' indicating a low, one-story house.",
        "visual_representation": "Picture a cozy, single-story house with a wide porch, surrounded by a garden, symbolizing a bungalow.",
        "example_sentence": "They spent the weekend relaxing in their peaceful bungalow by the lake."
    },
    {
        "word": "Cloying",
        "part_of_speech": "Adjective",
        "definition": "Disgust or sicken (someone) with an excess of sweetness, richness, or sentiment.",
        "hindi_meaning": "अतिशय मधुर, अस्वाभाविक रूप से मीठा",
        "mnemonic": "Cloying sounds like 'cloy-ing,' as if something is so sweet it clogs or cloys your senses.",
        "visual_representation": "Picture someone turning away from a dessert that is too sweet to enjoy, symbolizing something cloying.",
        "example_sentence": "The cloying scent of the overly sweet perfume was overwhelming."
    },
    {
        "word": "Discursive",
        "part_of_speech": "Adjective",
        "definition": "Digressing from subject to subject; rambling.",
        "hindi_meaning": "भटकने वाला, असंबद्ध",
        "mnemonic": "Discursive sounds like 'dis-course-ive,' indicating a conversation or writing that is all over the place, without focus.",
        "visual_representation": "Picture a speaker jumping from one topic to another without a clear connection, symbolizing discursive speech.",
        "example_sentence": "The professor’s lecture was so discursive that it was hard to follow his main point."
    },
    {
        "word": "Evanescent",
        "part_of_speech": "Adjective",
        "definition": "Quickly fading or disappearing; fleeting.",
        "hindi_meaning": "क्षणिक, अल्पकालिक",
        "mnemonic": "Evanescent sounds like 'even-scent,' as if a scent that quickly fades away, like something fleeting.",
        "visual_representation": "Picture a delicate bubble floating for a moment before bursting, symbolizing something evanescent.",
        "example_sentence": "The beauty of the sunset was evanescent, lasting only a few minutes before dusk settled in."
    },
    {
        "word": "Fundamental",
        "part_of_speech": "Adjective / Noun",
        "definition": "Forming a necessary base or core; of central importance; a basic principle, rule, or law.",
        "hindi_meaning": "मौलिक, बुनियादी; आधारभूत सिद्धांत",
        "mnemonic": "Fundamental sounds like 'fund-a-mental,' indicating something that funds or forms the base of a concept or system.",
        "visual_representation": "Picture the foundation of a building that supports everything above, symbolizing something fundamental.",
        "example_sentence": "Understanding basic math is fundamental to learning more advanced concepts."
    },
    {
        "word": "Generate",
        "part_of_speech": "Verb",
        "definition": "To cause (something, especially an emotion or situation) to arise or come about; to produce energy or power.",
        "hindi_meaning": "उत्पन्न करना, पैदा करना",
        "mnemonic": "Generate sounds like 'gen-e-rate,' as in creating or producing something new.",
        "visual_representation": "Picture a machine producing electricity or a conversation generating excitement, symbolizing generation.",
        "example_sentence": "The new policy generated a lot of interest among the employees."
    },
    {
        "word": "Indulgent",
        "part_of_speech": "Adjective",
        "definition": "Having or indicating a tendency to be overly generous or lenient with someone.",
        "hindi_meaning": "लाड़ प्यार करने वाला, उदार",
        "mnemonic": "Indulgent sounds like 'in-dull-gent,' as if being so gentle and permissive that it dulls the need for discipline.",
        "visual_representation": "Picture a parent giving in to every request of their child, symbolizing indulgent behavior.",
        "example_sentence": "The indulgent grandparents spoiled the child with too many sweets and toys."
    },
    {
        "word": "Lionize",
        "part_of_speech": "Verb",
        "definition": "To give a lot of public attention and approval to (someone); to treat as a celebrity.",
        "hindi_meaning": "महिमामंडित करना, किसी को नायक बनाना",
        "mnemonic": "Lionize sounds like 'lion-ize,' as if making someone as admired and revered as a lion.",
        "visual_representation": "Picture a person being cheered by a crowd and treated like a hero, symbolizing lionizing.",
        "example_sentence": "The press lionized the young athlete after she won the gold medal."
    },
    {
        "word": "Mosaic",
        "part_of_speech": "Noun / Adjective",
        "definition": "A picture or pattern produced by arranging together small colored pieces of hard material, such as stone, tile, or glass; something made up of different elements that form a coherent whole.",
        "hindi_meaning": "संगमरमर, टुकड़े जोड़कर बनाई गई कलाकृति",
        "mnemonic": "Mosaic sounds like 'mo-say-ic,' indicating a collection of small pieces coming together to form a picture or design.",
        "visual_representation": "Picture a colorful wall mural made up of many small tiles, symbolizing a mosaic.",
        "example_sentence": "The church’s walls were adorned with beautiful mosaics depicting religious scenes."
    },
    {
        "word": "Ostentatious",
        "part_of_speech": "Adjective",
        "definition": "Characterized by vulgar or pretentious display; designed to impress or attract notice.",
        "hindi_meaning": "दिखावटी, आडंबरपूर्ण",
        "mnemonic": "Ostentatious sounds like 'ost-rich-tatious,' as if someone is strutting like an ostentatious ostrich, showing off.",
        "visual_representation": "Picture a person wearing flashy, over-the-top clothes to draw attention, symbolizing ostentatious behavior.",
        "example_sentence": "The millionaire’s ostentatious mansion was filled with gold-plated furniture and expensive artwork."
    },
    {
        "word": "Plagiarism",
        "part_of_speech": "Noun",
        "definition": "The practice of taking someone else's work or ideas and passing them off as one's own.",
        "hindi_meaning": "साहित्यिक चोरी, चोरी करना",
        "mnemonic": "Plagiarism sounds like 'play-gery-ism,' as if playing or copying someone else's work.",
        "visual_representation": "Picture someone copying another person’s homework and claiming it as their own, symbolizing plagiarism.",
        "example_sentence": "The student was expelled for committing plagiarism in his research paper."
    },
    {
        "word": "Respiration",
        "part_of_speech": "Noun",
        "definition": "The action of breathing; the process in living organisms involving the production of energy, typically with the intake of oxygen and the release of carbon dioxide.",
        "hindi_meaning": "श्वसन, साँस लेना",
        "mnemonic": "Respiration sounds like 'respire-ation,' as in the act of taking in air to live.",
        "visual_representation": "Picture a person inhaling and exhaling deeply, symbolizing the process of respiration.",
        "example_sentence": "The patient's respiration was steady and normal after the surgery."
    },
    {
        "word": "Solemnity",
        "part_of_speech": "Noun",
        "definition": "The state or quality of being serious and dignified.",
        "hindi_meaning": "गंभीरता, गंभीर स्थिति",
        "mnemonic": "Solemnity sounds like 'solemn-ity,' indicating a serious or formal state.",
        "visual_representation": "Picture a formal ceremony where everyone is standing quietly and respectfully, symbolizing solemnity.",
        "example_sentence": "The solemnity of the occasion was marked by the silence of the gathered crowd."
    },
    {
        "word": "Tender",
        "part_of_speech": "Adjective / Verb / Noun",
        "definition": "(Adjective) Showing gentleness and concern; (Verb) To offer formally; (Noun) An offer to carry out work or supply goods at a stated price.",
        "hindi_meaning": "कोमल, विनम्र; पेशकश करना; निविदा",
        "mnemonic": "Tender sounds like 'tender-heart,' indicating a gentle and caring attitude, or offering something formally.",
        "visual_representation": "Picture someone gently cradling a small kitten, symbolizing tenderness, or submitting a formal bid in an envelope.",
        "example_sentence": "He was tender with the newborn puppy, handling it with care and affection."
    },
    {
        "word": "Vivacious",
        "part_of_speech": "Adjective",
        "definition": "Attractively lively and animated (especially of a woman).",
        "hindi_meaning": "जीवंत, उत्साही",
        "mnemonic": "Vivacious sounds like 'viv-a-cious,' as in full of life and energy, like the word 'vivid.'",
        "visual_representation": "Picture a lively person dancing energetically at a party, full of life and enthusiasm, symbolizing vivaciousness.",
        "example_sentence": "Her vivacious personality made her the life of every party."
    }
]
