[
    {
        "word": "Amiss",
        "part_of_speech": "Adjective / Adverb",
        "definition": "Not quite right; inappropriate or out of place; wrongly or inappropriately.",
        "hindi_meaning": "ग़लत, त्रुटिपूर्ण",
        "mnemonic": "Amiss sounds like 'a-miss,' as in something missed the mark or is not right.",
        "visual_representation": "Picture a clock that is slightly off time, symbolizing something amiss.",
        "example_sentence": "She could tell something was amiss when her friend didn't show up for their meeting."
    },
    {
        "word": "Barb",
        "part_of_speech": "Noun",
        "definition": "A sharp projection near the end of an arrow, fishhook, or similar item, angled away from the main point so as to make extraction difficult; a deliberately hurtful remark.",
        "hindi_meaning": "नुकीली बात, कटाक्ष",
        "mnemonic": "Barb sounds like 'sharp,' indicating something that can hurt or cause injury, like a sharp comment or a fishhook.",
        "visual_representation": "Picture a fishhook with a sharp, backward-facing point, symbolizing a barb.",
        "example_sentence": "His comment was full of barbs meant to sting and offend."
    },
    {
        "word": "Coin",
        "part_of_speech": "Verb / Noun",
        "definition": "To invent or devise (a new word or phrase); a flat, typically round piece of metal with an official stamp, used as money.",
        "hindi_meaning": "गढ़ना, शब्द बनाना; सिक्का",
        "mnemonic": "Coin sounds like 'coin-phrase,' as in coming up with a new phrase or word.",
        "visual_representation": "Picture someone creating a new word or phrase and stamping it like a coin, symbolizing coining a term.",
        "example_sentence": "The company coined the term 'eco-friendly' to describe its products."
    },
    {
        "word": "Dismantle",
        "part_of_speech": "Verb",
        "definition": "To take (a machine or structure) to pieces; to disassemble.",
        "hindi_meaning": "विघटित करना, तोड़ना",
        "mnemonic": "Dismantle sounds like 'dis-man-tle,' as in taking apart something that was put together by man.",
        "visual_representation": "Picture a mechanic taking apart a car engine, symbolizing dismantling.",
        "example_sentence": "The workers began to dismantle the old factory machinery."
    },
    {
        "word": "Execrable",
        "part_of_speech": "Adjective",
        "definition": "Extremely bad or unpleasant; detestable.",
        "hindi_meaning": "घृणित, अत्यंत बुरा",
        "mnemonic": "Execrable sounds like 'exe-crable,' as in something so bad that it should be exiled or cursed.",
        "visual_representation": "Picture a dish that tastes so bad it makes someone grimace, symbolizing execrable.",
        "example_sentence": "The food at the restaurant was execrable; we couldn't finish our meals."
    },
    {
        "word": "Fell",
        "part_of_speech": "Adjective / Verb",
        "definition": "(Adjective) Fierce, cruel, or terrible; (Verb) To knock down, strike down, or cut down (especially a tree).",
        "hindi_meaning": "क्रूर, भयंकर; गिराना, काटना",
        "mnemonic": "Fell sounds like 'fell-tree,' as in cutting down something or being deadly and fierce.",
        "visual_representation": "Picture a lumberjack cutting down a large tree, symbolizing felling.",
        "example_sentence": "The storm was so fell that it felled trees all over the city."
    },
    {
        "word": "Gentility",
        "part_of_speech": "Noun",
        "definition": "Social superiority as demonstrated by genteel manners, behavior, or appearances.",
        "hindi_meaning": "शिष्टता, सज्जनता",
        "mnemonic": "Gentility sounds like 'gentle-ity,' as in showing gentle and refined behavior.",
        "visual_representation": "Picture someone with refined manners, dressed elegantly and acting with grace, symbolizing gentility.",
        "example_sentence": "Her gentility and poise made her the perfect host for the gala."
    },
    {
        "word": "Infidel",
        "part_of_speech": "Noun",
        "definition": "A person who does not believe in religion or who adheres to a religion other than one's own.",
        "hindi_meaning": "नास्तिक, विधर्मी",
        "mnemonic": "Infidel sounds like 'in-faith-del,' as in someone who is not within the faith.",
        "visual_representation": "Picture someone being labeled an outsider by a religious group, symbolizing an infidel.",
        "example_sentence": "In the eyes of the devout community, he was considered an infidel."
    },
    {
        "word": "Litany",
        "part_of_speech": "Noun",
        "definition": "A series of petitions for use in church services or processions, usually recited by the clergy and responded to by the people; a tedious recital or repetitive series.",
        "hindi_meaning": "दीर्घ सूची, एक ही बात की पुनरावृत्ति",
        "mnemonic": "Litany sounds like 'list-any,' as in a long list of items or repeated phrases.",
        "visual_representation": "Picture someone reading a long, repetitive list during a ceremony, symbolizing a litany.",
        "example_sentence": "She recited a litany of complaints about her day."
    },
    {
        "word": "Muse",
        "part_of_speech": "Verb / Noun",
        "definition": "(Verb) To be absorbed in thought; to ponder; (Noun) A source of inspiration, especially for a creative artist.",
        "hindi_meaning": "विचार करना, ध्यान मग्न होना; प्रेरणा स्रोत",
        "mnemonic": "Muse sounds like 'muse-ic,' as in music that inspires or makes one think deeply.",
        "visual_representation": "Picture a writer staring thoughtfully at a blank page, drawing inspiration from a muse.",
        "example_sentence": "The artist found his muse in the beauty of nature."
    },
    {
        "word": "Ordinance",
        "part_of_speech": "Noun",
        "definition": "A piece of legislation enacted by a municipal authority; an authoritative order or decree.",
        "hindi_meaning": "अध्यादेश, नियम",
        "mnemonic": "Ordinance sounds like 'order-nance,' indicating an official order or rule.",
        "visual_representation": "Picture a city council passing a new law or rule, symbolizing an ordinance.",
        "example_sentence": "The city passed an ordinance requiring all dogs to be kept on leashes in public areas."
    },
    {
        "word": "Podiatrist",
        "part_of_speech": "Noun",
        "definition": "A medical professional specializing in the treatment of the feet and their ailments.",
        "hindi_meaning": "पैरों का डॉक्टर, पैर चिकित्सक",
        "mnemonic": "Podiatrist sounds like 'pod-iatrist,' with 'pod' relating to feet, indicating a foot doctor.",
        "visual_representation": "Picture a doctor examining a patient’s foot, symbolizing a podiatrist.",
        "example_sentence": "She visited the podiatrist to treat her recurring foot pain."
    },
    {
        "word": "Retract",
        "part_of_speech": "Verb",
        "definition": "To draw back or withdraw (a statement or accusation) as untrue or unjustified; to pull back something in or back.",
        "hindi_meaning": "वापस लेना, खींच लेना",
        "mnemonic": "Retract sounds like 're-track,' as in pulling back or reversing something.",
        "visual_representation": "Picture someone pulling back their hand after offering it, symbolizing retraction.",
        "example_sentence": "He had to retract his statement after realizing it was incorrect."
    },
    {
        "word": "Sovereign",
        "part_of_speech": "Noun / Adjective",
        "definition": "(Noun) A supreme ruler, especially a monarch; (Adjective) Possessing supreme or ultimate power.",
        "hindi_meaning": "संप्रभु, सर्वोच्च शासक",
        "mnemonic": "Sovereign sounds like 'so-reign,' as in someone who reigns supreme.",
        "visual_representation": "Picture a king wearing a crown, symbolizing sovereignty.",
        "example_sentence": "The country is a sovereign nation, governing itself without outside interference."
    },
    {
        "word": "Tractable",
        "part_of_speech": "Adjective",
        "definition": "(Of a person or animal) easy to control or influence; (Of a situation or problem) easy to deal with.",
        "hindi_meaning": "आज्ञाकारी, नियंत्रण में आने वाला",
        "mnemonic": "Tractable sounds like 'track-table,' as in easy to track or guide.",
        "visual_representation": "Picture a well-trained dog following commands easily, symbolizing tractability.",
        "example_sentence": "The horse was surprisingly tractable for a wild animal."
    },
    {
        "word": "Virtue",
        "part_of_speech": "Noun",
        "definition": "Behavior showing high moral standards; a good or useful quality.",
        "hindi_meaning": "सद्गुण, नैतिकता",
        "mnemonic": "Virtue sounds like 'vir-tue,' as in being true to virtuous and moral behavior.",
        "visual_representation": "Picture a person helping someone in need, symbolizing virtue.",
        "example_sentence": "Patience is a virtue often overlooked in today’s fast-paced world."
    }
]
