[
    {
        "word": "Amoral",
        "part_of_speech": "Adjective",
        "definition": "Lacking a moral sense; unconcerned with the rightness or wrongness of something.",
        "hindi_meaning": "नैतिकता रहित, अनैतिक",
        "mnemonic": "Amoral sounds like 'a-moral,' indicating the absence of morality or ethical considerations.",
        "visual_representation": "Picture someone making decisions purely based on self-interest without considering what's right or wrong, symbolizing amorality.",
        "example_sentence": "The character in the novel was portrayed as amoral, driven only by personal gain."
    },
    {
        "word": "Beam",
        "part_of_speech": "Noun / Verb",
        "definition": "(Noun) A long, sturdy piece of wood or metal used in construction; a ray or shaft of light. (Verb) To shine brightly; to smile radiantly.",
        "hindi_meaning": "किरण, चमक; मुस्कराहट",
        "mnemonic": "Beam sounds like 'beam of light,' indicating a strong ray of light or a bright smile.",
        "visual_representation": "Picture a strong, focused ray of sunlight shining through a window, or someone smiling broadly, symbolizing a beam.",
        "example_sentence": "The sun's beam lit up the room, and she beamed with joy at the good news."
    },
    {
        "word": "Collage",
        "part_of_speech": "Noun",
        "definition": "A piece of art made by sticking various different materials such as photographs and pieces of paper or fabric onto a backing.",
        "hindi_meaning": "कोलाज, विभिन्न सामग्रियों से बनी तस्वीर",
        "mnemonic": "Collage sounds like 'coll-age,' as in collecting different images or pieces into one artwork.",
        "visual_representation": "Picture a colorful artwork made from a mixture of photos, newspaper clippings, and fabric, symbolizing a collage.",
        "example_sentence": "She created a beautiful collage from her vacation photos."
    },
    {
        "word": "Disparage",
        "part_of_speech": "Verb",
        "definition": "To regard or represent as being of little worth; to belittle or degrade.",
        "hindi_meaning": "नीचा दिखाना, अपमानित करना",
        "mnemonic": "Disparage sounds like 'dis-praise,' as in not praising or showing disrespect.",
        "visual_representation": "Picture someone making dismissive comments about another's achievements, symbolizing disparagement.",
        "example_sentence": "He often disparaged his colleagues' efforts, making it difficult for them to work together."
    },
    {
        "word": "Exemplify",
        "part_of_speech": "Verb",
        "definition": "To be a typical example of; to illustrate or clarify by giving an example.",
        "hindi_meaning": "उदाहरण प्रस्तुत करना, उदाहरण देना",
        "mnemonic": "Exemplify sounds like 'example-fy,' as in providing an example to illustrate something.",
        "visual_representation": "Picture a teacher using a clear example to explain a complex concept, symbolizing exemplification.",
        "example_sentence": "Her actions exemplify the kind of leadership we need in this organization."
    },
    {
        "word": "Fiasco",
        "part_of_speech": "Noun",
        "definition": "A complete and embarrassing failure.",
        "hindi_meaning": "विफलता, बड़ी असफलता",
        "mnemonic": "Fiasco sounds like 'fi-as-co,' as in something going so wrong it's a complete disaster.",
        "visual_representation": "Picture a stage performance where everything goes wrong, leading to chaos and embarrassment, symbolizing a fiasco.",
        "example_sentence": "The event turned into a fiasco when the sound system failed and the speakers didn't show up."
    },
    {
        "word": "Grandiose",
        "part_of_speech": "Adjective",
        "definition": "Impressive or magnificent in appearance or style, especially pretentiously so; overly ambitious.",
        "hindi_meaning": "भव्य, आडंबरपूर्ण",
        "mnemonic": "Grandiose sounds like 'grand-iose,' indicating something grand but possibly exaggerated.",
        "visual_representation": "Picture a large, overly ornate building meant to impress but seeming excessive, symbolizing grandiosity.",
        "example_sentence": "His grandiose plans for the company's future were met with skepticism by the board."
    },
    {
        "word": "Inflated",
        "part_of_speech": "Adjective",
        "definition": "Excessively or unreasonably high; exaggerated.",
        "hindi_meaning": "बढ़ा-चढ़ा हुआ, फुला हुआ",
        "mnemonic": "Inflated sounds like 'in-flated,' as in something filled with air, puffed up, or exaggerated.",
        "visual_representation": "Picture a balloon being blown up until it's overly large, symbolizing something inflated.",
        "example_sentence": "The inflated prices at the boutique deterred many potential customers."
    },
    {
        "word": "Lassitude",
        "part_of_speech": "Noun",
        "definition": "A state of physical or mental weariness; lack of energy.",
        "hindi_meaning": "थकान, सुस्ती",
        "mnemonic": "Lassitude sounds like 'lazy-attitude,' indicating tiredness or a lack of energy.",
        "visual_representation": "Picture someone lying on a couch, too tired to move, symbolizing lassitude.",
        "example_sentence": "After the long hike, she was overcome with lassitude and needed to rest."
    },
    {
        "word": "Musty",
        "part_of_speech": "Adjective",
        "definition": "Having a stale, moldy, or damp smell.",
        "hindi_meaning": "सीलन भरा, बासी",
        "mnemonic": "Musty sounds like 'dusty-must,' indicating a smell associated with old, damp places.",
        "visual_representation": "Picture an old, damp basement filled with the smell of mildew, symbolizing mustiness.",
        "example_sentence": "The musty smell of the old books filled the library."
    },
    {
        "word": "Obfuscate",
        "part_of_speech": "Verb",
        "definition": "To render obscure, unclear, or unintelligible; to deliberately make something difficult to understand.",
        "hindi_meaning": "उलझाना, अस्पष्ट करना",
        "mnemonic": "Obfuscate sounds like 'ob-fuse-cate,' as in confusing or hiding the real meaning.",
        "visual_representation": "Picture a person using complex language to confuse the audience, symbolizing obfuscation.",
        "example_sentence": "The lawyer's attempt to obfuscate the facts only made the jury more suspicious."
    },
    {
        "word": "Polemical",
        "part_of_speech": "Adjective",
        "definition": "Relating to or involving strongly critical, controversial, or disputatious writing or speech.",
        "hindi_meaning": "विवादास्पद, वादात्मक",
        "mnemonic": "Polemical sounds like 'pole-mic-al,' as in someone standing at a pole with a mic, engaging in a heated debate.",
        "visual_representation": "Picture a heated debate on a controversial topic, symbolizing something polemical.",
        "example_sentence": "The polemical article sparked a heated debate among readers."
    },
    {
        "word": "Retroactive",
        "part_of_speech": "Adjective",
        "definition": "Taking effect from a date in the past.",
        "hindi_meaning": "भूतलक्षी, पूर्वव्यापी",
        "mnemonic": "Retroactive sounds like 'retro-active,' as in something active or effective in the past.",
        "visual_representation": "Picture a law being passed that affects actions taken months ago, symbolizing retroactivity.",
        "example_sentence": "The company announced a retroactive pay raise for all employees, effective from the beginning of the year."
    },
    {
        "word": "Spasmodic",
        "part_of_speech": "Adjective",
        "definition": "Occurring or done in brief, irregular bursts; relating to or affected by a spasm.",
        "hindi_meaning": "अनियमित, झटके से होने वाला",
        "mnemonic": "Spasmodic sounds like 'spasm-odic,' as in something like a spasm or happening in bursts.",
        "visual_representation": "Picture someone shivering in short, sudden bursts, symbolizing something spasmodic.",
        "example_sentence": "His work on the project was spasmodic, with intense periods of activity followed by long stretches of inactivity."
    },
    {
        "word": "Transparent",
        "part_of_speech": "Adjective",
        "definition": "Allowing light to pass through so that objects behind can be distinctly seen; easy to perceive or detect; open and honest.",
        "hindi_meaning": "पारदर्शी, स्पष्ट",
        "mnemonic": "Transparent sounds like 'trans-par-ent,' indicating something clear, like glass.",
        "visual_representation": "Picture a clear glass window through which everything can be seen, symbolizing transparency.",
        "example_sentence": "The company promised to be transparent in its dealings with customers."
    },
    {
        "word": "Valedictory",
        "part_of_speech": "Adjective / Noun",
        "definition": "(Adjective) Serving as a farewell; (Noun) A farewell address, especially one given at a graduation ceremony.",
        "hindi_meaning": "विदाई से संबंधित, विदाई भाषण",
        "mnemonic": "Valedictory sounds like 'vale-dictory,' as in bidding farewell (vale) in a speech.",
        "visual_representation": "Picture a student giving a farewell speech at graduation, symbolizing a valedictory address.",
        "example_sentence": "Her valedictory speech at the graduation ceremony was both touching and inspiring."
    }
]
