[
    {
      "word": "Allay",
      "part_of_speech": "Verb",
      "definition": "To diminish or put at rest (fear, suspicion, or worry); to relieve or alleviate (pain or hunger).",
      "hindi_meaning": "शांत करना, कम करना",
      "mnemonic": "Allay sounds like 'al-lay,' as if laying down your fears or worries to calm them.",
      "visual_representation": "Picture someone calming down a frightened child, symbolizing the act of allaying fear.",
      "example_sentence": "The doctor’s reassuring words helped to allay her anxiety about the surgery."
    },
    {
      "word": "Brochure",
      "part_of_speech": "Noun",
      "definition": "A small booklet or pamphlet, often containing information or advertising material.",
      "hindi_meaning": "पुस्तिका, पैम्फलेट",
      "mnemonic": "Brochure sounds like 'bro-sure,' as in showing your bro a small booklet with information.",
      "visual_representation": "Picture a colorful pamphlet with images and information about a tourist destination, symbolizing a brochure.",
      "example_sentence": "The travel agency provided a brochure detailing all the attractions in the city."
    },
    {
      "word": "Clandestine",
      "part_of_speech": "Adjective",
      "definition": "Kept secret or done secretively, especially because illicit.",
      "hindi_meaning": "गुप्त, छिपा हुआ",
      "mnemonic": "Clandestine sounds like 'clan-destine,' as if a secretive clan is doing something hidden.",
      "visual_representation": "Picture a secret meeting taking place in a dark, hidden room, symbolizing clandestine activities.",
      "example_sentence": "The spies held a clandestine meeting in an abandoned warehouse."
    },
    {
      "word": "Diagnosis",
      "part_of_speech": "Noun",
      "definition": "The identification of the nature of an illness or other problem by examination of the symptoms.",
      "hindi_meaning": "निदान, रोग का पता लगाना",
      "mnemonic": "Diagnosis sounds like 'die-gnosis,' as if identifying the root cause before it becomes serious.",
      "visual_representation": "Picture a doctor reviewing test results and determining the cause of a patient's symptoms, symbolizing diagnosis.",
      "example_sentence": "The doctor’s diagnosis revealed that she had a rare blood disorder."
    },
    {
      "word": "Eschew",
      "part_of_speech": "Verb",
      "definition": "To deliberately avoid using; to abstain from.",
      "hindi_meaning": "परहेज करना, बचना",
      "mnemonic": "Eschew sounds like 'ess-chew,' as if avoiding something distasteful or harmful.",
      "visual_representation": "Picture someone turning away from a tempting but unhealthy food, symbolizing eschewing it.",
      "example_sentence": "He eschews smoking and drinking, preferring a healthy lifestyle."
    },
    {
      "word": "Frenzied",
      "part_of_speech": "Adjective",
      "definition": "Wildly excited or uncontrolled.",
      "hindi_meaning": "उन्मत्त, पागलपन भरा",
      "mnemonic": "Frenzied sounds like 'frenzy-ed,' indicating a state of wild excitement or chaos.",
      "visual_representation": "Picture a crowd of people rushing around chaotically during a sale, symbolizing frenzied behavior.",
      "example_sentence": "The frenzied pace of the market caused many traders to panic."
    },
    {
      "word": "Graphic",
      "part_of_speech": "Adjective",
      "definition": "Relating to visual art, especially involving drawing, engraving, or lettering; vividly described.",
      "hindi_meaning": "चित्रात्मक, सजीव",
      "mnemonic": "Graphic sounds like 'graph-ic,' indicating something vividly depicted or drawn.",
      "visual_representation": "Picture a detailed and colorful illustration that vividly represents a scene, symbolizing something graphic.",
      "example_sentence": "The novel contains graphic descriptions of the battle scenes."
    },
    {
      "word": "Horde",
      "part_of_speech": "Noun",
      "definition": "A large group of people or animals, especially one on the move.",
      "hindi_meaning": "भीड़, झुंड",
      "mnemonic": "Horde sounds like 'hoard,' as in a large group that moves together, like a hoard of people or animals.",
      "visual_representation": "Picture a large group of people rushing into a store during a big sale, symbolizing a horde.",
      "example_sentence": "A horde of fans gathered outside the concert venue."
    },
    {
      "word": "Indifferent",
      "part_of_speech": "Adjective",
      "definition": "Having no particular interest or sympathy; unconcerned.",
      "hindi_meaning": "उदासीन, तटस्थ",
      "mnemonic": "Indifferent sounds like 'in-different,' as if not showing any difference in reaction or concern.",
      "visual_representation": "Picture someone shrugging their shoulders in response to a question, symbolizing indifference.",
      "example_sentence": "She was indifferent to the outcome of the election, as it didn’t affect her directly."
    },
    {
      "word": "Liaison",
      "part_of_speech": "Noun",
      "definition": "Communication or cooperation that facilitates a close working relationship between people or organizations; a person who acts as a link to assist communication or cooperation between groups of people.",
      "hindi_meaning": "संबंध, संपर्क अधिकारी",
      "mnemonic": "Liaison sounds like 'lay-ison,' as if someone laying the groundwork for communication between groups.",
      "visual_representation": "Picture a person coordinating between two teams to ensure they work together effectively, symbolizing a liaison.",
      "example_sentence": "The company appointed a liaison to manage communications with their overseas partners."
    },
    {
      "word": "Monochromatic",
      "part_of_speech": "Adjective",
      "definition": "Containing or using only one color.",
      "hindi_meaning": "एकरंगी, एकरूप",
      "mnemonic": "Monochromatic sounds like 'mono-chrome-atic,' indicating a single color scheme.",
      "visual_representation": "Picture a room decorated entirely in shades of one color, symbolizing something monochromatic.",
      "example_sentence": "The artist’s monochromatic painting used only shades of blue."
    },
    {
      "word": "Oligarchy",
      "part_of_speech": "Noun",
      "definition": "A small group of people having control of a country, organization, or institution.",
      "hindi_meaning": "कुलीनतंत्र, अल्पतंत्र",
      "mnemonic": "Oligarchy sounds like 'only-guard-key,' as if only a small group has the key to power.",
      "visual_representation": "Picture a few powerful individuals controlling a large group, symbolizing an oligarchy.",
      "example_sentence": "The country was ruled by an oligarchy of wealthy businessmen."
    },
    {
      "word": "Pillage",
      "part_of_speech": ["Verb", "Noun"],
      "definition": "To rob a place using violence, especially in wartime; the act of looting or plundering.",
      "hindi_meaning": "लूटपाट करना, डकैती",
      "mnemonic": "Pillage sounds like 'pill-age,' as if the action of looting and destroying as you go.",
      "visual_representation": "Picture a village being ransacked and looted during a war, symbolizing pillage.",
      "example_sentence": "The invading army pillaged the town, leaving it in ruins."
    },
    {
      "word": "Reputed",
      "part_of_speech": "Adjective",
      "definition": "Generally believed or considered to be a certain way, especially by reputation.",
      "hindi_meaning": "प्रसिद्ध, माने हुए",
      "mnemonic": "Reputed sounds like 'reputation-ed,' indicating someone or something known by reputation.",
      "visual_representation": "Picture a famous chef who is reputed for his culinary skills, symbolizing a well-known reputation.",
      "example_sentence": "The restaurant is reputed to serve the best seafood in town."
    },
    {
      "word": "Sluggard",
      "part_of_speech": "Noun",
      "definition": "A lazy, sluggish person.",
      "hindi_meaning": "आलसी, सुस्त व्यक्ति",
      "mnemonic": "Sluggard sounds like 'slug-ard,' as if someone moves slowly like a slug.",
      "visual_representation": "Picture someone lying in bed all day, avoiding any work, symbolizing a sluggard.",
      "example_sentence": "He was called a sluggard because he never helped out with the chores."
    },
    {
      "word": "Tycoon",
      "part_of_speech": "Noun",
      "definition": "A wealthy, powerful person in business or industry.",
      "hindi_meaning": "व्यापारी, उद्योगपति",
      "mnemonic": "Tycoon sounds like 'ty-coon,' as in a titan of industry who has lots of influence and wealth.",
      "visual_representation": "Picture a successful businessperson in a high-rise office overlooking a city, symbolizing a tycoon.",
      "example_sentence": "The media tycoon owns several television networks and newspapers."
    },
    {
      "word": "Verdant",
      "part_of_speech": "Adjective",
      "definition": "(Of countryside) green with grass or other rich vegetation.",
      "hindi_meaning": "हरा-भरा, हरीतिमा से युक्त",
      "mnemonic": "Verdant sounds like 'verde-ant,' as in green and lush, like the Spanish word 'verde' (green).",
      "visual_representation": "Picture a lush, green field full of vibrant plants, symbolizing verdant landscapes.",
      "example_sentence": "The verdant hills were dotted with wildflowers in full bloom."
    }
]

