[
    {
        "word": "Alloy",
        "part_of_speech": "Noun / Verb",
        "definition": "A metal made by combining two or more metallic elements, especially to give greater strength or resistance to corrosion; to mix metals to create an alloy.",
        "hindi_meaning": "मिश्र धातु, मिश्रण",
        "mnemonic": "Alloy sounds like 'all-oy,' indicating a mix of different metals or elements.",
        "visual_representation": "Picture a blacksmith melting different metals together to create a stronger material, symbolizing an alloy.",
        "example_sentence": "Bronze is an alloy of copper and tin."
    },
    {
        "word": "Buffet",
        "part_of_speech": "Verb / Noun",
        "definition": "(Verb) To strike repeatedly and violently; to knock about. (Noun) A meal consisting of several dishes from which guests serve themselves.",
        "hindi_meaning": "मारना, धक्का देना; खाने की मेज़",
        "mnemonic": "Buffet as a verb sounds like 'buffet' as in hitting or pushing repeatedly, and as a noun, it reminds one of a table full of food.",
        "visual_representation": "Picture a ship being tossed by strong waves, symbolizing something being buffeted by forces, or a large table with various dishes for self-serving.",
        "example_sentence": "The small boat was buffeted by the strong winds."
    },
    {
        "word": "Cliché",
        "part_of_speech": "Noun",
        "definition": "A phrase or opinion that is overused and betrays a lack of original thought.",
        "hindi_meaning": "घिसा-पिटा वाक्यांश, पुरानी बात",
        "mnemonic": "Cliché sounds like 'click-ay,' as in a phrase that gets used so often it 'clicks' in everyone’s mind as unoriginal.",
        "visual_representation": "Picture a light bulb above someone’s head, representing a common, overused idea or phrase, symbolizing a cliché.",
        "example_sentence": "The phrase 'better late than never' is a cliché often used to justify tardiness."
    },
    {
        "word": "Discourse",
        "part_of_speech": "Noun / Verb",
        "definition": "(Noun) Written or spoken communication or debate. (Verb) To speak or write authoritatively about a topic.",
        "hindi_meaning": "बातचीत, प्रवचन; चर्चा करना",
        "mnemonic": "Discourse sounds like 'discuss-course,' indicating a course of conversation or communication.",
        "visual_representation": "Picture a group of scholars engaging in deep discussion or debate, symbolizing discourse.",
        "example_sentence": "The professor’s discourse on modern philosophy was both enlightening and engaging."
    },
    {
        "word": "Ethos",
        "part_of_speech": "Noun",
        "definition": "The characteristic spirit of a culture, era, or community as manifested in its attitudes and aspirations.",
        "hindi_meaning": "नैतिक चरित्र, आदर्श",
        "mnemonic": "Ethos sounds like 'ethics,' indicating the values or spirit that guide a community or culture.",
        "visual_representation": "Picture a community rallying around a shared belief or principle, symbolizing ethos.",
        "example_sentence": "The company’s ethos emphasizes sustainability and social responsibility."
    },
    {
        "word": "Frugality",
        "part_of_speech": "Noun",
        "definition": "The quality of being economical with money or food; thriftiness.",
        "hindi_meaning": "मितव्ययिता, किफ़ायत",
        "mnemonic": "Frugality sounds like 'frugal-ity,' as in being careful and economical with resources.",
        "visual_representation": "Picture someone carefully budgeting their expenses, symbolizing frugality.",
        "example_sentence": "Her frugality allowed her to save a significant amount of money each month."
    },
    {
        "word": "Guise",
        "part_of_speech": "Noun",
        "definition": "An external form, appearance, or manner of presentation, typically concealing the true nature of something.",
        "hindi_meaning": "भेष, रूप",
        "mnemonic": "Guise sounds like 'disguise,' indicating an appearance that hides the true nature of something.",
        "visual_representation": "Picture someone wearing a mask or a costume, symbolizing a guise.",
        "example_sentence": "The thief entered the building in the guise of a delivery man."
    },
    {
        "word": "Heterogeneous",
        "part_of_speech": "Adjective",
        "definition": "Diverse in character or content; composed of different kinds or types.",
        "hindi_meaning": "विषम, मिश्रित",
        "mnemonic": "Heterogeneous sounds like 'hetero-gen-eous,' indicating a mix of different types or elements.",
        "visual_representation": "Picture a bowl filled with different types of fruits, symbolizing something heterogeneous.",
        "example_sentence": "The neighborhood is known for its heterogeneous population, with people from various cultural backgrounds."
    },
    {
        "word": "Indissoluble",
        "part_of_speech": "Adjective",
        "definition": "Unable to be destroyed or undone; lasting.",
        "hindi_meaning": "अविनाशी, अघटनीय",
        "mnemonic": "Indissoluble sounds like 'in-dis-solve-able,' indicating something that cannot be dissolved or broken down.",
        "visual_representation": "Picture a strong, unbreakable chain, symbolizing something indissoluble.",
        "example_sentence": "The bonds of friendship they formed during their youth were indissoluble."
    },
    {
        "word": "Luster",
        "part_of_speech": "Noun",
        "definition": "A gentle sheen or soft glow, especially that of a partly reflective surface.",
        "hindi_meaning": "चमक, दीप्ति",
        "mnemonic": "Luster sounds like 'lust-er,' as in something that shines or glows with attraction.",
        "visual_representation": "Picture a shiny, polished piece of metal reflecting light, symbolizing luster.",
        "example_sentence": "The luster of the diamond caught everyone’s attention at the party."
    },
    {
        "word": "Morbid",
        "part_of_speech": "Adjective",
        "definition": "Characterized by or appealing to an abnormal and unhealthy interest in disturbing and unpleasant subjects, especially death and disease.",
        "hindi_meaning": "रोगी, विकृत",
        "mnemonic": "Morbid sounds like 'mor-bid,' as if having a bad or sick interest in death or gloom.",
        "visual_representation": "Picture someone obsessed with dark, gloomy thoughts, symbolizing a morbid fascination.",
        "example_sentence": "His morbid curiosity about crime scenes disturbed his friends."
    },
    {
        "word": "Opportune",
        "part_of_speech": "Adjective",
        "definition": "(Of a time) well-chosen or particularly favorable or appropriate.",
        "hindi_meaning": "उचित, उपयुक्त",
        "mnemonic": "Opportune sounds like 'opportunity-tune,' indicating the perfect timing for an opportunity.",
        "visual_representation": "Picture someone arriving just in time to catch the last train, symbolizing an opportune moment.",
        "example_sentence": "She arrived at an opportune moment, just as the meeting was about to start."
    },
    {
        "word": "Pithy",
        "part_of_speech": "Adjective",
        "definition": "(Of language or style) concise and forcefully expressive.",
        "hindi_meaning": "सारगर्भित, संक्षिप्त",
        "mnemonic": "Pithy sounds like 'pith-y,' indicating something that gets to the core or essence, like the pith of a fruit.",
        "visual_representation": "Picture a short, powerful quote that conveys a deep meaning in few words, symbolizing pithy language.",
        "example_sentence": "His pithy remarks during the debate won him many supporters."
    },
    {
        "word": "Resigned",
        "part_of_speech": "Adjective",
        "definition": "Having accepted something unpleasant that one cannot do anything about.",
        "hindi_meaning": "पराजित, असहाय",
        "mnemonic": "Resigned sounds like 're-sign-ed,' as if someone has signed off on accepting their fate.",
        "visual_representation": "Picture someone sighing and accepting a difficult situation without protest, symbolizing resignation.",
        "example_sentence": "She felt resigned to her fate, knowing there was nothing more she could do."
    },
    {
        "word": "Snivel",
        "part_of_speech": "Verb",
        "definition": "To cry and sniffle; to complain in a whining or tearful way.",
        "hindi_meaning": "सुबकना, नाक साफ करना",
        "mnemonic": "Snivel sounds like 'sniff-le,' indicating someone crying and sniffing in a whiny manner.",
        "visual_representation": "Picture a child crying and wiping their nose while complaining, symbolizing sniveling.",
        "example_sentence": "The boy began to snivel when his mother told him he couldn’t have more candy."
    },
    {
        "word": "Tarantula",
        "part_of_speech": "Noun",
        "definition": "A large, hairy spider found chiefly in tropical and subtropical America, some kinds of which have a venomous bite.",
        "hindi_meaning": "बड़ा मकड़ा, टारन्टुला",
        "mnemonic": "Tarantula sounds like 'tara-ant-ula,' indicating a large, intimidating spider.",
        "visual_representation": "Picture a big, hairy spider slowly crawling across the ground, symbolizing a tarantula.",
        "example_sentence": "She was terrified when she saw a tarantula crawling near the campsite."
    },
    {
        "word": "Vicarious",
        "part_of_speech": "Adjective",
        "definition": "Experienced in the imagination through the feelings or actions of another person.",
        "hindi_meaning": "परक, प्रतिनिधिक",
        "mnemonic": "Vicarious sounds like 'vi-carious,' as in living life through someone else's experiences.",
        "visual_representation": "Picture someone watching an adventure movie and feeling the excitement as if they were actually there, symbolizing vicarious experience.",
        "example_sentence": "He gets vicarious pleasure from reading about the adventures of others."
    }
]
