[
    {
        "word": "Ancillary",
        "part_of_speech": "Adjective / Noun",
        "definition": "(Adjective) Providing necessary support to the primary activities or operation of an organization, institution, industry, or system; (Noun) A person whose work provides necessary support to the primary activities of an organization.",
        "hindi_meaning": "सहायक, पूरक",
        "mnemonic": "Ancillary sounds like 'ancil-ary,' as in something that assists or supports the main entity.",
        "visual_representation": "Picture a small gear working alongside a larger one, both essential to the machine's operation, symbolizing ancillary support.",
        "example_sentence": "The ancillary staff at the hospital ensure that the doctors and nurses can focus on patient care."
    },
    {
        "word": "Blandishment",
        "part_of_speech": "Noun",
        "definition": "A flattering or pleasing statement or action used to persuade someone gently to do something.",
        "hindi_meaning": "चापलूसी, खुशामद",
        "mnemonic": "Blandishment sounds like 'bland-ish-meant,' as in something meant to be sweet and persuasive, not genuine.",
        "visual_representation": "Picture someone using exaggerated compliments to get what they want, symbolizing blandishment.",
        "example_sentence": "Despite the salesperson's blandishments, she refused to buy the expensive handbag."
    },
    {
        "word": "Comparable",
        "part_of_speech": "Adjective",
        "definition": "Able to be likened to another; similar; of equivalent quality.",
        "hindi_meaning": "तुलनीय, समकक्ष",
        "mnemonic": "Comparable sounds like 'compare-able,' as in something that can be compared because of its similarity.",
        "visual_representation": "Picture two cars side by side, being compared for their features, symbolizing comparability.",
        "example_sentence": "The two candidates' qualifications were comparable, making the hiring decision difficult."
    },
    {
        "word": "Dissolute",
        "part_of_speech": "Adjective",
        "definition": "Lax in morals; licentious.",
        "hindi_meaning": "चरित्रहीन, भ्रष्ट",
        "mnemonic": "Dissolute sounds like 'dis-salute,' as in not deserving a salute because of loose morals.",
        "visual_representation": "Picture someone engaging in wild, reckless behavior without any concern for moral values, symbolizing a dissolute lifestyle.",
        "example_sentence": "The dissolute behavior of the actor eventually led to his downfall in Hollywood."
    },
    {
        "word": "Expertise",
        "part_of_speech": "Noun",
        "definition": "Expert skill or knowledge in a particular field.",
        "hindi_meaning": "विशेषज्ञता, निपुणता",
        "mnemonic": "Expertise sounds like 'expert-ize,' as in the quality of being an expert in something.",
        "visual_representation": "Picture a surgeon performing a delicate operation with skill and precision, symbolizing expertise.",
        "example_sentence": "Her expertise in data analysis made her the best candidate for the job."
    },
    {
        "word": "Foreboding",
        "part_of_speech": "Noun / Adjective",
        "definition": "(Noun) A feeling that something bad will happen; (Adjective) Implying or seeming to imply that something bad is going to happen.",
        "hindi_meaning": "पूर्वाभास, अनिष्टसूचक",
        "mnemonic": "Foreboding sounds like 'fore-bodying,' as in a feeling in your body that something bad is coming.",
        "visual_representation": "Picture dark clouds gathering on the horizon, symbolizing a sense of foreboding.",
        "example_sentence": "She had a foreboding sense that something was about to go terribly wrong."
    },
    {
        "word": "Guile",
        "part_of_speech": "Noun",
        "definition": "Sly or cunning intelligence.",
        "hindi_meaning": "छल, धूर्तता",
        "mnemonic": "Guile sounds like 'guy-l,' as in a guy who is sly or tricky.",
        "visual_representation": "Picture a fox sneaking around, known for its cunning nature, symbolizing guile.",
        "example_sentence": "The politician used guile to win the election, deceiving the voters with false promises."
    },
    {
        "word": "Injurious",
        "part_of_speech": "Adjective",
        "definition": "Causing or likely to cause damage or harm.",
        "hindi_meaning": "हानिकारक, नुक़सानदेह",
        "mnemonic": "Injurious sounds like 'injury-us,' as in something that can cause injury or harm.",
        "visual_representation": "Picture a warning sign next to a hazardous chemical, symbolizing something injurious.",
        "example_sentence": "Smoking is injurious to health, increasing the risk of lung cancer."
    },
    {
        "word": "Lummox",
        "part_of_speech": "Noun",
        "definition": "A clumsy, stupid person.",
        "hindi_meaning": "बेवकूफ, भद्दा आदमी",
        "mnemonic": "Lummox sounds like 'lump-ox,' as in a heavy, clumsy ox.",
        "visual_representation": "Picture someone tripping over their own feet and knocking things over, symbolizing a lummox.",
        "example_sentence": "He felt like a lummox after spilling his drink all over the table."
    },
    {
        "word": "Marked",
        "part_of_speech": "Adjective",
        "definition": "Clearly noticeable; evident.",
        "hindi_meaning": "स्पष्ट, प्रमुख",
        "mnemonic": "Marked sounds like 'mark-ed,' as in something clearly marked or noticeable.",
        "visual_representation": "Picture a path with clear, marked signs, showing that it’s easy to follow, symbolizing something evident.",
        "example_sentence": "There was a marked difference in his attitude after the promotion."
    },
    {
        "word": "Potentate",
        "part_of_speech": "Noun",
        "definition": "A monarch or ruler, especially an autocratic one.",
        "hindi_meaning": "शासक, प्रभु",
        "mnemonic": "Potentate sounds like 'potent-state,' as in a ruler with powerful control over a state.",
        "visual_representation": "Picture a king sitting on a throne, holding a scepter, symbolizing a potentate.",
        "example_sentence": "The potentate ruled his kingdom with absolute authority."
    },
    {
        "word": "Rig",
        "part_of_speech": "Verb / Noun",
        "definition": "(Verb) To set up (equipment or a device) in a makeshift or hasty manner; to manipulate or control something dishonestly; (Noun) Equipment or gear; a large truck or trailer.",
        "hindi_meaning": "जोड़ना, धोखाधड़ी करना; उपकरण",
        "mnemonic": "Rig sounds like 'rig-up,' as in setting something up quickly or dishonestly.",
        "visual_representation": "Picture someone setting up a stage with ropes and pulleys in a hurry, or tampering with an election, symbolizing rigging.",
        "example_sentence": "The mechanic rigged the old car to start just enough to get it to the shop."
    },
    {
        "word": "Squalor",
        "part_of_speech": "Noun",
        "definition": "A state of being extremely dirty and unpleasant, especially as a result of poverty or neglect.",
        "hindi_meaning": "गंदगी, दयनीय स्थिति",
        "mnemonic": "Squalor sounds like 'squall-or,' as in a dirty, stormy environment.",
        "visual_representation": "Picture a rundown, filthy apartment with trash everywhere, symbolizing squalor.",
        "example_sentence": "They lived in squalor, with barely enough food to survive."
    },
    {
        "word": "Tenacity",
        "part_of_speech": "Noun",
        "definition": "The quality or fact of being very determined; persistent.",
        "hindi_meaning": "दृढ़ता, अटलता",
        "mnemonic": "Tenacity sounds like 'ten-ace-ity,' as in holding on to something with the grip of ten aces.",
        "visual_representation": "Picture a mountain climber hanging onto the cliff edge, refusing to give up, symbolizing tenacity.",
        "example_sentence": "Her tenacity in overcoming obstacles inspired everyone around her."
    }
]
