[
    {
        "word": "Amalgamate",
        "part_of_speech": "Verb",
        "definition": "To combine or unite to form one organization or structure.",
        "hindi_meaning": "सम्मिलित करना, मिलाना",
        "mnemonic": "Amalgamate sounds like 'a-mall-gate,' as if combining multiple stores into one mall.",
        "visual_representation": "Picture two companies merging into one larger entity, symbolizing amalgamation.",
        "example_sentence": "The two businesses decided to amalgamate to form a stronger, more competitive company."
    },
    {
        "word": "Buoyant",
        "part_of_speech": "Adjective",
        "definition": "Able to stay afloat or rise to the top of a liquid or gas; cheerful and optimistic.",
        "hindi_meaning": "तैरने योग्य, उत्साही",
        "mnemonic": "Buoyant sounds like 'boy-ant,' as in a buoy or a boy being light and able to float.",
        "visual_representation": "Picture a buoy floating effortlessly on water, symbolizing buoyancy, or someone with a happy, positive attitude.",
        "example_sentence": "Despite the challenges, she remained buoyant and optimistic about the future."
    },
    {
        "word": "Coalesce",
        "part_of_speech": "Verb",
        "definition": "To come together to form one mass or whole.",
        "hindi_meaning": "एकीकृत करना, जुड़ना",
        "mnemonic": "Coalesce sounds like 'coal-less,' as if different pieces of coal coming together to form a single block.",
        "visual_representation": "Picture droplets of water merging to form a larger puddle, symbolizing coalescence.",
        "example_sentence": "The various factions within the party coalesced to form a united front."
    },
    {
        "word": "Disembark",
        "part_of_speech": "Verb",
        "definition": "To leave a ship, aircraft, or other vehicle.",
        "hindi_meaning": "उतरना, बाहर निकलना",
        "mnemonic": "Disembark sounds like 'dis-embark,' as in getting off a ship or vehicle.",
        "visual_representation": "Picture passengers stepping off a plane after landing, symbolizing disembarkation.",
        "example_sentence": "After a long journey, the passengers were eager to disembark the cruise ship."
    },
    {
        "word": "Evenhanded",
        "part_of_speech": "Adjective",
        "definition": "Fair and impartial in treatment or judgment.",
        "hindi_meaning": "निष्पक्ष, न्यायपूर्ण",
        "mnemonic": "Evenhanded sounds like 'even-hand-ed,' as in treating both sides evenly or fairly.",
        "visual_representation": "Picture a judge weighing both sides of a case equally, symbolizing evenhandedness.",
        "example_sentence": "The teacher’s evenhanded approach ensured that all students were treated fairly."
    },
    {
        "word": "Furor",
        "part_of_speech": "Noun",
        "definition": "An outbreak of public anger or excitement.",
        "hindi_meaning": "गुस्सा, उत्तेजना",
        "mnemonic": "Furor sounds like 'fur-roar,' as in a roaring reaction of public excitement or anger.",
        "visual_representation": "Picture a crowd of people reacting passionately to a controversial event, symbolizing a furor.",
        "example_sentence": "The announcement of the new policy caused a furor among the citizens."
    },
    {
        "word": "Ghastly",
        "part_of_speech": "Adjective",
        "definition": "Causing great horror or fear; frightful or macabre.",
        "hindi_meaning": "भयानक, डरावना",
        "mnemonic": "Ghastly sounds like 'ghost-ly,' as in something that is terrifying or horrifying like a ghost.",
        "visual_representation": "Picture a haunted house with eerie, frightening imagery, symbolizing something ghastly.",
        "example_sentence": "The accident scene was so ghastly that it left everyone in shock."
    },
    {
        "word": "Inebriated",
        "part_of_speech": "Adjective",
        "definition": "Drunk; intoxicated.",
        "hindi_meaning": "नशे में, मदहोश",
        "mnemonic": "Inebriated sounds like 'in-ebrated,' as if someone is in a state of intoxication.",
        "visual_representation": "Picture a person stumbling and unable to walk straight after drinking too much, symbolizing inebriation.",
        "example_sentence": "He was so inebriated after the party that he had to call a taxi to get home safely."
    },
    {
        "word": "Low",
        "part_of_speech": "Verb / Noun",
        "definition": "To make the characteristic deep sound of a cow; the deep sound made by cattle.",
        "hindi_meaning": "गाए की आवाज़, रंभाना",
        "mnemonic": "Low sounds like 'cow,' as in the deep sound a cow makes.",
        "visual_representation": "Picture a cow in a field making a deep, resonant sound, symbolizing a low.",
        "example_sentence": "The cows lowed softly as they were herded into the barn."
    },
    {
        "word": "Motif",
        "part_of_speech": "Noun",
        "definition": "A distinctive feature or dominant idea in an artistic or literary composition.",
        "hindi_meaning": "रूपांकन, प्रमुख विषय",
        "mnemonic": "Motif sounds like 'mo-theme,' indicating a recurring theme or element in a work of art or literature.",
        "visual_representation": "Picture a repeated pattern or design on a fabric, symbolizing a motif, or a recurring theme in a story.",
        "example_sentence": "The floral motif in the wallpaper added a touch of elegance to the room."
    },
    {
        "word": "Onerous",
        "part_of_speech": "Adjective",
        "definition": "Involving a great deal of effort, trouble, or difficulty; burdensome.",
        "hindi_meaning": "कष्टदायक, कठिन",
        "mnemonic": "Onerous sounds like 'on-erous,' as if a heavy burden is on someone’s shoulders.",
        "visual_representation": "Picture someone carrying a heavy load up a steep hill, symbolizing an onerous task.",
        "example_sentence": "The new regulations placed onerous responsibilities on the small business owners."
    },
    {
        "word": "Plaintive",
        "part_of_speech": "Adjective",
        "definition": "Sounding sad and mournful.",
        "hindi_meaning": "दुखभरा, करुण",
        "mnemonic": "Plaintive sounds like 'plain-tive,' as in a plain, sad tone of voice.",
        "visual_representation": "Picture someone singing a slow, sorrowful song, symbolizing plaintiveness.",
        "example_sentence": "The plaintive cry of the orphaned child moved everyone to tears."
    },
    {
        "word": "Resplendent",
        "part_of_speech": "Adjective",
        "definition": "Attractive and impressive through being richly colorful or sumptuous.",
        "hindi_meaning": "चमकदार, भव्य",
        "mnemonic": "Resplendent sounds like 're-splendid,' indicating something splendid or glowing with beauty.",
        "visual_representation": "Picture a majestic peacock with its colorful feathers fully spread, symbolizing resplendence.",
        "example_sentence": "The bride looked resplendent in her elaborate wedding gown."
    },
    {
        "word": "Solicitous",
        "part_of_speech": "Adjective",
        "definition": "Showing interest or concern.",
        "hindi_meaning": "चिंतित, फ़िक्रमंद",
        "mnemonic": "Solicitous sounds like 'solicit-us,' as in someone who is concerned or caring towards us.",
        "visual_representation": "Picture someone constantly checking on a friend to make sure they’re okay, symbolizing solicitous behavior.",
        "example_sentence": "She was always solicitous about the well-being of her family."
    },
    {
        "word": "Termination",
        "part_of_speech": "Noun",
        "definition": "The action of bringing something or coming to an end.",
        "hindi_meaning": "समाप्ति, अंत",
        "mnemonic": "Termination sounds like 'terminate-ion,' indicating the act of ending something.",
        "visual_representation": "Picture a road that suddenly stops at a cliff’s edge, symbolizing termination.",
        "example_sentence": "The termination of the contract left the employees without jobs."
    },
    {
        "word": "Vertex",
        "part_of_speech": "Noun",
        "definition": "The highest point; the top or apex.",
        "hindi_meaning": "शीर्ष, चोटी",
        "mnemonic": "Vertex sounds like 'vert-ex,' as in the vertical top point of something.",
        "visual_representation": "Picture a mountain peak as the highest point in a range, symbolizing the vertex.",
        "example_sentence": "From the vertex of the mountain, we could see the entire valley below."
    }
]
