[
    {
        "word": "Ambidextrous",
        "part_of_speech": "Adjective",
        "definition": "Able to use both hands equally well; very skillful or versatile.",
        "hindi_meaning": "सिद्धहस्त, दोनों हाथों का समान रूप से प्रयोग करने वाला",
        "mnemonic": "Ambidextrous sounds like 'ambi-dex-trous,' as if someone is 'dexterous' with both 'ambi' (two) hands.",
        "visual_representation": "Picture someone writing with both hands simultaneously, symbolizing ambidexterity.",
        "example_sentence": "The ambidextrous artist could paint beautifully with either hand."
    },
    {
        "word": "Burgeon",
        "part_of_speech": "Verb",
        "definition": "To begin to grow or increase rapidly; to flourish.",
        "hindi_meaning": "फलना-फूलना, तेजी से बढ़ना",
        "mnemonic": "Burgeon sounds like 'burge-on,' as in something that 'burgeons' or quickly grows and flourishes.",
        "visual_representation": "Picture a plant rapidly growing and blooming with flowers, symbolizing burgeoning growth.",
        "example_sentence": "The city's population began to burgeon after the new economic policies were introduced."
    },
    {
        "word": "Coddle",
        "part_of_speech": "Verb",
        "definition": "To treat in an indulgent or overprotective way.",
        "hindi_meaning": "लाड़-प्यार करना, अत्यधिक देखभाल करना",
        "mnemonic": "Coddle sounds like 'cuddle,' as in treating someone with excessive care or affection.",
        "visual_representation": "Picture a parent wrapping their child in blankets and feeding them soup, symbolizing coddling.",
        "example_sentence": "She was accused of coddling her son, making him too dependent on her."
    },
    {
        "word": "Disengage",
        "part_of_speech": "Verb",
        "definition": "To separate or release (someone or something) from something to which they are attached or connected.",
        "hindi_meaning": "अलग करना, मुक्त करना",
        "mnemonic": "Disengage sounds like 'dis-engage,' as in stopping engagement or connection.",
        "visual_representation": "Picture two gears that are no longer meshing together, symbolizing disengagement.",
        "example_sentence": "The astronaut had to carefully disengage the safety harness before exiting the spacecraft."
    },
    {
        "word": "Evocative",
        "part_of_speech": "Adjective",
        "definition": "Bringing strong images, memories, or feelings to mind.",
        "hindi_meaning": "यादें जगाने वाला, भावुकता उत्पन्न करने वाला",
        "mnemonic": "Evocative sounds like 'evoke-ative,' as in something that evokes or brings out memories or emotions.",
        "visual_representation": "Picture a photograph that brings back vivid memories of a past event, symbolizing something evocative.",
        "example_sentence": "The evocative music brought back memories of her childhood."
    },
    {
        "word": "Fusion",
        "part_of_speech": "Noun",
        "definition": "The process or result of joining two or more things together to form a single entity.",
        "hindi_meaning": "संलयन, मिश्रण",
        "mnemonic": "Fusion sounds like 'fuse-ion,' as in fusing or blending things together.",
        "visual_representation": "Picture two different styles of cuisine coming together to create a new, blended dish, symbolizing fusion.",
        "example_sentence": "The restaurant is known for its fusion cuisine, which blends flavors from different cultures."
    },
    {
        "word": "Gloat",
        "part_of_speech": "Verb",
        "definition": "To dwell on one’s own success or another’s misfortune with smugness or malignant pleasure.",
        "hindi_meaning": "इतराना, विजयी भाव से घमंड करना",
        "mnemonic": "Gloat sounds like 'goat,' as in the 'Greatest Of All Time' feeling superior and showing off.",
        "visual_representation": "Picture someone smirking and boasting about their success while others struggle, symbolizing gloating.",
        "example_sentence": "He couldn't help but gloat over his rival's defeat."
    },
    {
        "word": "Ineffectual",
        "part_of_speech": "Adjective",
        "definition": "Not producing any or the desired effect; ineffective.",
        "hindi_meaning": "असफल, निष्फल",
        "mnemonic": "Ineffectual sounds like 'in-effectual,' indicating something that does not produce the desired effect.",
        "visual_representation": "Picture someone trying to start a fire with wet matches, symbolizing ineffectual efforts.",
        "example_sentence": "The coach’s attempts to motivate the team were ineffectual, as they lost the game."
    },
    {
        "word": "Lackluster",
        "part_of_speech": "Adjective",
        "definition": "Lacking in vitality, force, or conviction; uninspired or uninspiring.",
        "hindi_meaning": "फीका, बेरंग",
        "mnemonic": "Lackluster sounds like 'lack-luster,' indicating something lacking brightness or excitement.",
        "visual_representation": "Picture a dull, dimly lit light bulb, symbolizing something that is lackluster.",
        "example_sentence": "The team’s lackluster performance disappointed the fans."
    },
    {
        "word": "Mottled",
        "part_of_speech": "Adjective",
        "definition": "Marked with spots or smears of color.",
        "hindi_meaning": "धब्बेदार, चित्तीदार",
        "mnemonic": "Mottled sounds like 'spot-tled,' indicating something that is spotted or blotchy.",
        "visual_representation": "Picture a dog with a coat that has patches of different colors, symbolizing mottled fur.",
        "example_sentence": "The artist’s canvas was covered in mottled shades of blue and green."
    },
    {
        "word": "Obtrude",
        "part_of_speech": "Verb",
        "definition": "To become noticeable in an unwelcome or intrusive way; to impose or force something on someone.",
        "hindi_meaning": "हस्तक्षेप करना, घुसपैठ करना",
        "mnemonic": "Obtrude sounds like 'ob-trood,' as in intruding or pushing something unwanted into attention.",
        "visual_representation": "Picture someone interrupting a private conversation with an unwanted opinion, symbolizing obtrusion.",
        "example_sentence": "He didn't want to obtrude on their privacy, so he left the room quietly."
    },
    {
        "word": "Platitude",
        "part_of_speech": "Noun",
        "definition": "A remark or statement, especially one with a moral content, that has been used too often to be interesting or thoughtful.",
        "hindi_meaning": "साधारण कथन, घिसी-पिटी बात",
        "mnemonic": "Platitude sounds like 'plat-it-dude,' indicating a flat or dull statement that has lost its impact.",
        "visual_representation": "Picture someone delivering a boring, overused speech filled with clichés, symbolizing a platitude.",
        "example_sentence": "His speech was full of platitudes about the importance of hard work and honesty."
    },
    {
        "word": "Restitution",
        "part_of_speech": "Noun",
        "definition": "The restoration of something lost or stolen to its proper owner; recompense for injury or loss.",
        "hindi_meaning": "पुनः प्राप्ति, हर्जाना",
        "mnemonic": "Restitution sounds like 'restitution-restitution,' as in restoring or returning something to its rightful place.",
        "visual_representation": "Picture someone returning a stolen item to its owner and apologizing, symbolizing restitution.",
        "example_sentence": "The court ordered the thief to pay restitution to the victim for the stolen goods."
    },
    {
        "word": "Solitude",
        "part_of_speech": "Noun",
        "definition": "The state of being alone, often by choice, in a quiet or remote place.",
        "hindi_meaning": "एकांत, अकेलापन",
        "mnemonic": "Solitude sounds like 'solo-tude,' indicating a state of being alone or isolated.",
        "visual_representation": "Picture a person sitting alone on a quiet mountaintop, enjoying the peace of solitude.",
        "example_sentence": "She enjoyed the solitude of her cabin in the woods, far from the noise of the city."
    },
    {
        "word": "Thematic",
        "part_of_speech": "Adjective",
        "definition": "Relating to or based on subjects or themes; of or relating to a particular subject.",
        "hindi_meaning": "विषयगत, विषय से संबंधित",
        "mnemonic": "Thematic sounds like 'theme-atic,' indicating something organized around a central theme.",
        "visual_representation": "Picture a party where everything, from decorations to activities, follows a specific theme, symbolizing something thematic.",
        "example_sentence": "The exhibition was thematic, with each room representing a different period in history."
    },
    {
        "word": "Venerate",
        "part_of_speech": "Verb",
        "definition": "To regard with great respect; to revere.",
        "hindi_meaning": "सम्मान करना, पूजना",
        "mnemonic": "Venerate sounds like 'ven-erate,' as if elevating someone to a position of honor and respect.",
        "visual_representation": "Picture a group of people bowing in reverence to a respected elder or leader, symbolizing veneration.",
        "example_sentence": "The community venerates the old teacher for his decades of service and wisdom."
    }
]
