[
    {
        "word": "Ancestry",
        "part_of_speech": "Noun",
        "definition": "One's family or ethnic descent; the lineage or line of ancestors from whom a person is descended.",
        "hindi_meaning": "वंशावली, पूर्वज",
        "mnemonic": "Ancestry sounds like 'ancestors-tree,' referring to the family tree of one's ancestors.",
        "visual_representation": "Picture a family tree showing generations of ancestors, symbolizing ancestry.",
        "example_sentence": "She traced her ancestry back to a small village in Ireland."
    },
    {
        "word": "Bilk",
        "part_of_speech": "Verb",
        "definition": "To cheat or defraud someone, especially by avoiding payment or deceiving them.",
        "hindi_meaning": "धोखा देना, ठगना",
        "mnemonic": "Bilk sounds like 'bill-k,' as in avoiding a bill or payment through trickery.",
        "visual_representation": "Picture someone running away without paying their bill at a restaurant, symbolizing bilking.",
        "example_sentence": "The con artist bilked elderly people out of their savings with a fake investment scheme."
    },
    {
        "word": "Compact",
        "part_of_speech": "Adjective / Noun / Verb",
        "definition": "(Adjective) Closely and neatly packed together; dense; (Noun) A formal agreement or contract between two or more parties; (Verb) To make or become denser or more tightly packed.",
        "hindi_meaning": "सघन, ठोस; समझौता; दबाना",
        "mnemonic": "Compact sounds like 'com-packed,' indicating something closely packed or an agreement.",
        "visual_representation": "Picture a small, dense, portable makeup case or a handshake sealing a deal, symbolizing a compact.",
        "example_sentence": "The compact car was perfect for navigating the narrow city streets."
    },
    {
        "word": "Dissimulate",
        "part_of_speech": "Verb",
        "definition": "To conceal or disguise (one's thoughts, feelings, or character).",
        "hindi_meaning": "छिपाना, ढोंग करना",
        "mnemonic": "Dissimulate sounds like 'dis-simulate,' as in not simulating or showing the true feelings.",
        "visual_representation": "Picture someone smiling while hiding their true anger or intentions, symbolizing dissimulation.",
        "example_sentence": "He tried to dissimulate his nervousness during the interview by smiling and acting confident."
    },
    {
        "word": "Expedite",
        "part_of_speech": "Verb",
        "definition": "To make (an action or process) happen sooner or be accomplished more quickly.",
        "hindi_meaning": "शीघ्र करना, तेज़ी से करना",
        "mnemonic": "Expedite sounds like 'express-dit,' as in express delivery to speed up the process.",
        "visual_representation": "Picture a fast-moving conveyor belt speeding up a production process, symbolizing expediting.",
        "example_sentence": "The company hired extra staff to expedite the completion of the project."
    },
    {
        "word": "Foment",
        "part_of_speech": "Verb",
        "definition": "To instigate or stir up (an undesirable or violent sentiment or course of action).",
        "hindi_meaning": "भड़काना, उकसाना",
        "mnemonic": "Foment sounds like 'foam-ment,' as in stirring up something that bubbles over, like foam.",
        "visual_representation": "Picture someone spreading rumors to stir up trouble in a group, symbolizing fomenting.",
        "example_sentence": "The rebels tried to foment unrest by spreading propaganda."
    },
    {
        "word": "Germane",
        "part_of_speech": "Adjective",
        "definition": "Relevant to a subject under consideration; fitting and appropriate.",
        "hindi_meaning": "उपयुक्त, प्रासंगिक",
        "mnemonic": "Germane sounds like 'germ-main,' as in the main point that is relevant or fitting.",
        "visual_representation": "Picture a puzzle piece fitting perfectly into a puzzle, symbolizing something that is germane.",
        "example_sentence": "His comments were not germane to the discussion and were therefore ignored."
    },
    {
        "word": "Iniquitous",
        "part_of_speech": "Adjective",
        "definition": "Grossly unfair and morally wrong; wicked or unjust.",
        "hindi_meaning": "अन्यायी, पापपूर्ण",
        "mnemonic": "Iniquitous sounds like 'in-equal-ous,' as in something unequal or unjust.",
        "visual_representation": "Picture a corrupt judge taking bribes to make unfair rulings, symbolizing iniquitous behavior.",
        "example_sentence": "The iniquitous tax policies disproportionately affected the poor."
    },
    {
        "word": "Lope",
        "part_of_speech": "Verb",
        "definition": "To run or move with a long bounding stride.",
        "hindi_meaning": "लंबी छलांग के साथ दौड़ना",
        "mnemonic": "Lope sounds like 'lope-pace,' as in running at a steady, bounding pace.",
        "visual_representation": "Picture a wolf or horse running gracefully with long, steady strides, symbolizing loping.",
        "example_sentence": "The horse loped across the field with ease."
    },
    {
        "word": "Manifest",
        "part_of_speech": "Adjective / Verb",
        "definition": "(Adjective) Clear or obvious to the eye or mind; (Verb) To show or demonstrate (a quality or feeling) by one's acts or appearance; to display.",
        "hindi_meaning": "स्पष्ट, ज़ाहिर; प्रदर्शित करना",
        "mnemonic": "Manifest sounds like 'man-infest,' as in making something obvious or clear, like an infestation.",
        "visual_representation": "Picture a person clearly showing their excitement with a big smile and open arms, symbolizing manifesting.",
        "example_sentence": "His happiness was manifest in the way he greeted everyone with a smile."
    },
    {
        "word": "Potable",
        "part_of_speech": "Adjective",
        "definition": "Safe to drink; drinkable.",
        "hindi_meaning": "पीने योग्य",
        "mnemonic": "Potable sounds like 'pot-able,' as in water from a pot that is safe to drink.",
        "visual_representation": "Picture a clean, clear glass of water with a checkmark next to it, symbolizing potability.",
        "example_sentence": "The river water is not potable without proper treatment."
    },
    {
        "word": "Rife",
        "part_of_speech": "Adjective",
        "definition": "(Especially of something undesirable or harmful) widespread; full of.",
        "hindi_meaning": "प्रचुर मात्रा में, व्यापक",
        "mnemonic": "Rife sounds like 'life-full,' as in full of something, often negative.",
        "visual_representation": "Picture a city filled with posters about a crime wave, symbolizing something that is rife.",
        "example_sentence": "The town was rife with rumors about the mysterious disappearance."
    },
    {
        "word": "Spurn",
        "part_of_speech": "Verb",
        "definition": "To reject with disdain or contempt.",
        "hindi_meaning": "तिरस्कार करना, ठुकराना",
        "mnemonic": "Spurn sounds like 'spurn,' as in turning away or rejecting someone or something.",
        "visual_representation": "Picture someone turning their back and walking away from an offered hand, symbolizing spurning.",
        "example_sentence": "She spurned his advances, making it clear that she was not interested."
    },
    {
        "word": "Tautology",
        "part_of_speech": "Noun",
        "definition": "The saying of the same thing twice in different words, generally considered to be a fault of style.",
        "hindi_meaning": "अनावश्यक पुनरावृत्ति",
        "mnemonic": "Tautology sounds like 'tauto-logy,' as in repeating the same logic or idea redundantly.",
        "visual_representation": "Picture someone repeating the same point in a speech over and over, symbolizing tautology.",
        "example_sentence": "Saying 'free gift' is a tautology because a gift is always free."
    }
]
