[
    {
        "word": "Amend",
        "part_of_speech": "Verb",
        "definition": "To make changes to a text, piece of legislation, or statement to improve it; to modify, alter, or fix.",
        "hindi_meaning": "संशोधित करना, सुधार करना",
        "mnemonic": "Amend sounds like 'a-mend,' as in mending or fixing something to make it better.",
        "visual_representation": "Picture someone revising and correcting a document, symbolizing amendment.",
        "example_sentence": "The committee voted to amend the proposal before passing it."
    },
    {
        "word": "Badinage",
        "part_of_speech": "Noun",
        "definition": "Humorous or witty conversation; playful teasing.",
        "hindi_meaning": "परिहास, हंसी-मजाक",
        "mnemonic": "Badinage sounds like 'bad-in-age,' but think of it as playful banter, not something bad.",
        "visual_representation": "Picture friends engaging in light-hearted teasing and jokes, symbolizing badinage.",
        "example_sentence": "The badinage between the talk show hosts kept the audience entertained."
    },
    {
        "word": "Cognizance",
        "part_of_speech": "Noun",
        "definition": "Awareness, knowledge, or notice of something.",
        "hindi_meaning": "ज्ञान, समझ",
        "mnemonic": "Cognizance sounds like 'cog-nize-ance,' as in recognizing or being aware of something.",
        "visual_representation": "Picture a person becoming aware of an important detail, symbolizing cognizance.",
        "example_sentence": "The judge took cognizance of the new evidence presented in the case."
    },
    {
        "word": "Disinter",
        "part_of_speech": "Verb",
        "definition": "To dig up something that has been buried, especially a corpse; to discover something that has been hidden.",
        "hindi_meaning": "खोद निकालना, पुनः प्रकट करना",
        "mnemonic": "Disinter sounds like 'dis-in-ter,' as in bringing something up from the earth (interred).",
        "visual_representation": "Picture archaeologists unearthing ancient artifacts, symbolizing disinterring.",
        "example_sentence": "The police decided to disinter the body to gather more evidence."
    },
    {
        "word": "Excise",
        "part_of_speech": "Verb / Noun",
        "definition": "To cut out or remove something completely; a tax levied on certain goods or services.",
        "hindi_meaning": "हटाना, निकालना; उत्पाद शुल्क",
        "mnemonic": "Excise sounds like 'ex-size,' as in cutting out or removing a part, like resizing something.",
        "visual_representation": "Picture a surgeon carefully cutting out a tumor, symbolizing excising.",
        "example_sentence": "The editor decided to excise several paragraphs from the final draft."
    },
    {
        "word": "Fathom",
        "part_of_speech": "Verb / Noun",
        "definition": "To understand something deeply; a unit of length equal to six feet, used especially in reference to the depth of water.",
        "hindi_meaning": "गहराई नापना, समझना; फाथम (छह फीट)",
        "mnemonic": "Fathom sounds like 'fath-hum,' as in understanding the depths of a problem or the deep ocean.",
        "visual_representation": "Picture someone thinking deeply to understand a complex problem, symbolizing fathoming.",
        "example_sentence": "It’s hard to fathom the reasons behind such a drastic decision."
    },
    {
        "word": "Gustatory",
        "part_of_speech": "Adjective",
        "definition": "Relating to the sense of taste.",
        "hindi_meaning": "स्वाद संबंधी, स्वाद के प्रति",
        "mnemonic": "Gustatory sounds like 'gust-taste-ory,' indicating something related to tasting.",
        "visual_representation": "Picture someone savoring a delicious meal, fully engaging their sense of taste, symbolizing gustatory experience.",
        "example_sentence": "The chef's dish provided a delightful gustatory experience."
    },
    {
        "word": "Infamous",
        "part_of_speech": "Adjective",
        "definition": "Well known for some bad quality or deed; having a bad reputation.",
        "hindi_meaning": "बदनाम, कुख्यात",
        "mnemonic": "Infamous sounds like 'in-fame-ous,' but with a negative twist—famous for something bad.",
        "visual_representation": "Picture a notorious criminal whose face is known for wrongdoings, symbolizing infamy.",
        "example_sentence": "The dictator was infamous for his brutal regime."
    },
    {
        "word": "Limpid",
        "part_of_speech": "Adjective",
        "definition": "Clear and transparent; easily understood.",
        "hindi_meaning": "स्वच्छ, पारदर्शी",
        "mnemonic": "Limpid sounds like 'limp-id,' as in water so clear it appears limp or still.",
        "visual_representation": "Picture a crystal-clear lake where you can see to the bottom, symbolizing limpidness.",
        "example_sentence": "The limpid water of the mountain stream was refreshing to drink."
    },
    {
        "word": "Mundane",
        "part_of_speech": "Adjective",
        "definition": "Lacking interest or excitement; dull; of this earthly world rather than a heavenly or spiritual one.",
        "hindi_meaning": "साधारण, सांसारिक",
        "mnemonic": "Mundane sounds like 'mund-ane,' as in something that is boring or ordinary, like a mundane routine.",
        "visual_representation": "Picture a person doing repetitive, boring tasks day after day, symbolizing mundaneness.",
        "example_sentence": "She longed for adventure to break the monotony of her mundane life."
    },
    {
        "word": "Orgy",
        "part_of_speech": "Noun",
        "definition": "A wild party, especially one involving excessive drinking and unrestrained sexual activity; excessive indulgence in a specified activity.",
        "hindi_meaning": "उन्मुक्त पार्टी, उन्माद",
        "mnemonic": "Orgy sounds like 'org-y,' as in an event of wild and uncontrolled behavior.",
        "visual_representation": "Picture a chaotic party where people are indulging in extreme behavior, symbolizing an orgy.",
        "example_sentence": "The tabloids reported on the scandalous orgy that took place at the celebrity's mansion."
    },
    {
        "word": "Plumb",
        "part_of_speech": "Verb / Adjective / Adverb",
        "definition": "To measure the depth of something; to explore or experience fully or to extremes; vertical or exactly.",
        "hindi_meaning": "गहराई मापना, पूरी तरह समझना; सीधा",
        "mnemonic": "Plumb sounds like 'plum,' which can drop to measure depth or explore fully.",
        "visual_representation": "Picture a plumber using a plumb line to ensure pipes are perfectly vertical, symbolizing plumbing depth or accuracy.",
        "example_sentence": "The novel plumbs the depths of human emotion with great sensitivity."
    },
    {
        "word": "Reticence",
        "part_of_speech": "Noun",
        "definition": "The quality of being reserved, restrained, or reluctant to speak freely.",
        "hindi_meaning": "मितभाषिता, चुप्पी",
        "mnemonic": "Reticence sounds like 're-tie-sense,' as if tying or holding back one’s words.",
        "visual_representation": "Picture someone standing quietly in a group, choosing not to share their thoughts, symbolizing reticence.",
        "example_sentence": "His reticence in meetings was often mistaken for a lack of interest."
    },
    {
        "word": "Sophistry",
        "part_of_speech": "Noun",
        "definition": "The use of clever but false arguments, especially with the intention of deceiving.",
        "hindi_meaning": "कुतर्क, छलपूर्ण तर्क",
        "mnemonic": "Sophistry sounds like 'so-fist-ry,' as in using a fistful of tricky words to deceive.",
        "visual_representation": "Picture a lawyer twisting facts in a misleading way to win a case, symbolizing sophistry.",
        "example_sentence": "The politician's argument was dismissed as mere sophistry designed to mislead the public."
    },
    {
        "word": "Topography",
        "part_of_speech": "Noun",
        "definition": "The arrangement of the natural and artificial physical features of an area.",
        "hindi_meaning": "स्थलाकृतिक, भूगोलिक नक्शा",
        "mnemonic": "Topography sounds like 'top-o-graphy,' indicating the mapping of land's surface features.",
        "visual_representation": "Picture a detailed map showing mountains, rivers, and valleys, symbolizing topography.",
        "example_sentence": "The topography of the region made it ideal for hiking and outdoor activities."
    },
    {
        "word": "Virulent",
        "part_of_speech": "Adjective",
        "definition": "Extremely severe or harmful in its effects; bitterly hostile or antagonistic.",
        "hindi_meaning": "तीव्र, विषैला",
        "mnemonic": "Virulent sounds like 'virus-lent,' as in something highly infectious or harmful, like a virus.",
        "visual_representation": "Picture a rapidly spreading disease that is highly dangerous, symbolizing virulence.",
        "example_sentence": "The virulent strain of the virus spread quickly through the population."
    }
]
