[
    {
        "word": "Allegiance",
        "part_of_speech": "Noun",
        "definition": "Loyalty or commitment to a superior, group, or cause.",
        "hindi_meaning": "निष्ठा, वफादारी",
        "mnemonic": "Allegiance sounds like 'al-lie-gence,' as in not lying but showing loyalty and true allegiance.",
        "visual_representation": "Picture a knight kneeling and swearing loyalty to a king, symbolizing allegiance.",
        "example_sentence": "The soldiers pledged their allegiance to the country."
    },
    {
        "word": "Browbeat",
        "part_of_speech": "Verb",
        "definition": "To intimidate someone, typically into doing something, with stern or abusive words.",
        "hindi_meaning": "डराना-धमकाना, रौब दिखाना",
        "mnemonic": "Browbeat sounds like 'brow-beat,' as if someone is beating down on you with their words or attitude.",
        "visual_representation": "Picture a boss yelling at an employee to intimidate them into submission, symbolizing browbeating.",
        "example_sentence": "The witness was browbeaten by the aggressive lawyer during the trial."
    },
    {
        "word": "Clapper",
        "part_of_speech": "Noun",
        "definition": "The part inside a bell that swings to make the bell ring; a person who applauds.",
        "hindi_meaning": "घंटी की जीभ, ताली बजाने वाला",
        "mnemonic": "Clapper sounds like 'clap-er,' indicating something or someone that makes noise or applause.",
        "visual_representation": "Picture the metal piece inside a large bell that strikes the sides to make it ring, symbolizing a clapper.",
        "example_sentence": "The clapper inside the bell swung back and forth, producing a loud chime."
    },
    {
        "word": "Discomposure",
        "part_of_speech": "Noun",
        "definition": "A state of being unsettled or disturbed.",
        "hindi_meaning": "बेचैनी, अस्थिरता",
        "mnemonic": "Discomposure sounds like 'dis-compose,' as in someone losing their composure or calm.",
        "visual_representation": "Picture someone fidgeting and looking uncomfortable in a stressful situation, symbolizing discomposure.",
        "example_sentence": "The unexpected question caused noticeable discomposure in the speaker."
    },
    {
        "word": "Espionage",
        "part_of_speech": "Noun",
        "definition": "The practice of spying or using spies, typically by governments to obtain political and military information.",
        "hindi_meaning": "जासूसी, गुप्तचरी",
        "mnemonic": "Espionage sounds like 'es-pi-on-age,' indicating the age-old practice of spying.",
        "visual_representation": "Picture a secret agent gathering classified information, symbolizing espionage.",
        "example_sentence": "He was accused of espionage after being caught passing state secrets to a foreign government."
    },
    {
        "word": "Fret",
        "part_of_speech": "Verb / Noun",
        "definition": "To be constantly or visibly worried or anxious; a state of anxiety or worry.",
        "hindi_meaning": "चिंता करना, घबराहट",
        "mnemonic": "Fret sounds like 'fray-it,' as if worrying so much that it frays your nerves.",
        "visual_representation": "Picture someone biting their nails and pacing back and forth, symbolizing fretting.",
        "example_sentence": "Don’t fret about the exam; you’ve studied hard and will do well."
    },
    {
        "word": "Gravity",
        "part_of_speech": "Noun",
        "definition": "The force that attracts a body toward the center of the earth; extreme importance or seriousness.",
        "hindi_meaning": "गुरुत्वाकर्षण, गंभीरता",
        "mnemonic": "Gravity sounds like 'grave-ity,' indicating seriousness or the force that pulls things down.",
        "visual_representation": "Picture a serious judge presiding over a courtroom, symbolizing the gravity of the situation.",
        "example_sentence": "The gravity of the situation was evident in the faces of everyone in the room."
    },
    {
        "word": "Halting",
        "part_of_speech": "Adjective",
        "definition": "Slow and hesitant, especially through lack of confidence; faltering.",
        "hindi_meaning": "रुक-रुक कर, लड़खड़ाता हुआ",
        "mnemonic": "Halting sounds like 'halt-ing,' as in stopping or starting with uncertainty.",
        "visual_representation": "Picture someone speaking nervously, with long pauses and hesitation, symbolizing halting speech.",
        "example_sentence": "Her halting speech made it clear she was nervous about speaking in public."
    },
    {
        "word": "Indigent",
        "part_of_speech": "Adjective / Noun",
        "definition": "Poor; needy; a poor or needy person.",
        "hindi_meaning": "गरीब, दरिद्र",
        "mnemonic": "Indigent sounds like 'in-dig-gent,' as in digging in the dirt to survive due to poverty.",
        "visual_representation": "Picture a homeless person with tattered clothes, symbolizing indigence.",
        "example_sentence": "The charity provides assistance to indigent families who struggle to make ends meet."
    },
    {
        "word": "Linguistic",
        "part_of_speech": "Adjective",
        "definition": "Relating to language or linguistics.",
        "hindi_meaning": "भाषाविज्ञान संबंधी, भाषाई",
        "mnemonic": "Linguistic sounds like 'linguist-ic,' indicating something related to languages or linguistics.",
        "visual_representation": "Picture a linguist studying different languages and scripts, symbolizing linguistic study.",
        "example_sentence": "The linguistic diversity of the region makes it a fascinating place for language scholars."
    },
    {
        "word": "Monosyllabic",
        "part_of_speech": "Adjective",
        "definition": "Consisting of one syllable; using brief words to express an idea, often in a curt or abrupt manner.",
        "hindi_meaning": "एकाक्षरी, एकमात्रिक",
        "mnemonic": "Monosyllabic sounds like 'mono-syllable-ic,' indicating words with just one syllable.",
        "visual_representation": "Picture someone answering questions with only short, single-syllable words, symbolizing monosyllabic speech.",
        "example_sentence": "His monosyllabic responses suggested that he was in no mood to talk."
    },
    {
        "word": "Opulence",
        "part_of_speech": "Noun",
        "definition": "Great wealth or luxuriousness.",
        "hindi_meaning": "वैभव, ऐश्वर्य",
        "mnemonic": "Opulence sounds like 'op-u-lence,' as if something is so rich and lavish it’s overwhelming.",
        "visual_representation": "Picture a grand palace with gold decorations and expensive furnishings, symbolizing opulence.",
        "example_sentence": "The opulence of the mansion was evident in its marble floors and crystal chandeliers."
    },
    {
        "word": "Pinnacle",
        "part_of_speech": "Noun",
        "definition": "The highest point of success, power, fame, etc.; a peak or summit.",
        "hindi_meaning": "शिखर, उच्चतम बिंदु",
        "mnemonic": "Pinnacle sounds like 'pin-nacle,' as if pinning something at the highest point.",
        "visual_representation": "Picture a mountain climber reaching the very top of a mountain, symbolizing the pinnacle of achievement.",
        "example_sentence": "Winning the Nobel Prize was the pinnacle of her career."
    },
    {
        "word": "Requisite",
        "part_of_speech": "Adjective / Noun",
        "definition": "Made necessary by particular circumstances or regulations; a thing that is necessary for the achievement of a specified end.",
        "hindi_meaning": "आवश्यक, जरुरी",
        "mnemonic": "Requisite sounds like 'require-sit,' indicating something that is required or necessary.",
        "visual_representation": "Picture a checklist with all the necessary items marked as requisites for a trip.",
        "example_sentence": "Completing the training course is a requisite for certification."
    },
    {
        "word": "Slur",
        "part_of_speech": "Noun / Verb",
        "definition": "An insulting or disparaging remark or innuendo; to speak unclearly or insultingly.",
        "hindi_meaning": "अपमानजनक टिप्पणी, गाली देना",
        "mnemonic": "Slur sounds like 'blur,' indicating speech that’s unclear or a comment that’s meant to insult.",
        "visual_representation": "Picture someone making a derogatory remark that offends others, symbolizing a slur.",
        "example_sentence": "The politician’s speech was criticized for containing a racial slur."
    },
    {
        "word": "Tyranny",
        "part_of_speech": "Noun",
        "definition": "Cruel and oppressive government or rule; absolute power, especially when exercised unjustly or cruelly.",
        "hindi_meaning": "तानाशाही, अत्याचार",
        "mnemonic": "Tyranny sounds like 'ty-ran-ny,' as in a tyrant ruling harshly.",
        "visual_representation": "Picture a dictator ruling with an iron fist, symbolizing tyranny.",
        "example_sentence": "The citizens rebelled against the tyranny of the oppressive regime."
    },
    {
        "word": "Vilify",
        "part_of_speech": "Verb",
        "definition": "To speak or write about someone in an abusively disparaging manner.",
        "hindi_meaning": "बदनाम करना, निंदा करना",
        "mnemonic": "Vilify sounds like 'villain-fy,' as if making someone into a villain through abusive talk.",
        "visual_representation": "Picture someone spreading harmful rumors about another person to damage their reputation, symbolizing vilification.",
        "example_sentence": "He was vilified in the press for his controversial remarks."
    }
]
