[
    {
        "word": "Amorphous",
        "part_of_speech": "Adjective",
        "definition": "Without a clearly defined shape or form; lacking a clear structure or focus.",
        "hindi_meaning": "बिना आकार का, अनिश्चित आकार का",
        "mnemonic": "Amorphous sounds like 'a-morph-us,' indicating something without a specific form or structure.",
        "visual_representation": "Picture a cloud of smoke or mist that doesn't have a distinct shape, symbolizing amorphousness.",
        "example_sentence": "The artist's abstract painting was amorphous, with no clear shapes or figures."
    },
    {
        "word": "Befuddle",
        "part_of_speech": "Verb",
        "definition": "To confuse or perplex someone.",
        "hindi_meaning": "भ्रमित करना, उलझन में डालना",
        "mnemonic": "Befuddle sounds like 'be-fuddle,' as in becoming muddled or confused.",
        "visual_representation": "Picture someone scratching their head, trying to make sense of a complex problem, symbolizing befuddlement.",
        "example_sentence": "The complex instructions befuddled the students, leaving them unsure of what to do next."
    },
    {
        "word": "Collateral",
        "part_of_speech": "Noun / Adjective",
        "definition": "(Noun) Something pledged as security for repayment of a loan; (Adjective) Additional but subordinate; secondary.",
        "hindi_meaning": "गिरवी रखी हुई चीज़; सहायक, गौण",
        "mnemonic": "Collateral sounds like 'co-lateral,' indicating something that supports or is secondary to something else.",
        "visual_representation": "Picture a house being pledged as security for a loan, symbolizing collateral.",
        "example_sentence": "He had to put up his car as collateral to secure the loan."
    },
    {
        "word": "Disparity",
        "part_of_speech": "Noun",
        "definition": "A great difference or inequality.",
        "hindi_meaning": "असमानता, अंतर",
        "mnemonic": "Disparity sounds like 'dis-pair-ity,' indicating a lack of equality or pairing.",
        "visual_representation": "Picture two scales with one side much heavier than the other, symbolizing disparity.",
        "example_sentence": "There is a significant disparity in income between the richest and poorest members of society."
    },
    {
        "word": "Exertion",
        "part_of_speech": "Noun",
        "definition": "Physical or mental effort.",
        "hindi_meaning": "प्रयास, मेहनत",
        "mnemonic": "Exertion sounds like 'exer-tion,' similar to exercise, which requires effort.",
        "visual_representation": "Picture someone lifting heavy weights at the gym, symbolizing exertion.",
        "example_sentence": "After hours of exertion, they finally managed to move the heavy furniture."
    },
    {
        "word": "Figurine",
        "part_of_speech": "Noun",
        "definition": "A small, carved or molded statue, especially one of a human form.",
        "hindi_meaning": "मूर्ति, छोटी प्रतिमा",
        "mnemonic": "Figurine sounds like 'figure-ine,' indicating a small figure or statue.",
        "visual_representation": "Picture a small statue of a person or animal on a shelf, symbolizing a figurine.",
        "example_sentence": "She collects porcelain figurines and displays them in a glass cabinet."
    },
    {
        "word": "Gruff",
        "part_of_speech": "Adjective",
        "definition": "Rough and low in pitch (typically of a voice); abrupt or curt in manner.",
        "hindi_meaning": "कर्कश, कठोर",
        "mnemonic": "Gruff sounds like 'rough,' indicating a harsh or stern manner.",
        "visual_representation": "Picture someone speaking in a deep, rough voice, or acting abruptly, symbolizing gruffness.",
        "example_sentence": "Despite his gruff exterior, he was very kind-hearted."
    },
    {
        "word": "Informal",
        "part_of_speech": "Adjective",
        "definition": "Having a relaxed, friendly, or unofficial style, manner, or nature.",
        "hindi_meaning": "अनौपचारिक, सहज",
        "mnemonic": "Informal sounds like 'in-formal,' indicating something not bound by formal rules or customs.",
        "visual_representation": "Picture a casual gathering of friends, where everyone is dressed comfortably, symbolizing informality.",
        "example_sentence": "The meeting was informal, so there was no need to wear a suit."
    },
    {
        "word": "Laud",
        "part_of_speech": "Verb / Noun",
        "definition": "(Verb) To praise highly, especially in a public context; (Noun) Praise.",
        "hindi_meaning": "प्रशंसा करना, सराहना",
        "mnemonic": "Laud sounds like 'applaud,' indicating high praise.",
        "visual_representation": "Picture a crowd clapping and cheering for a performer, symbolizing laudation.",
        "example_sentence": "The critic lauded the director's new film as a masterpiece."
    },
    {
        "word": "Muted",
        "part_of_speech": "Adjective",
        "definition": "(Of a sound or voice) quiet and soft; not expressed strongly or openly.",
        "hindi_meaning": "दबा हुआ, मद्धम",
        "mnemonic": "Muted sounds like 'mute-ed,' indicating something softened or subdued.",
        "visual_representation": "Picture a TV with the volume turned down, symbolizing a muted sound.",
        "example_sentence": "The muted colors of the painting created a calm and serene atmosphere."
    },
    {
        "word": "Overwrought",
        "part_of_speech": "Adjective",
        "definition": "In a state of excessive nervousness, excitement, or anxiety; too elaborate or complicated in design or construction.",
        "hindi_meaning": "अत्यधिक उत्तेजित, अत्यधिक जटिल",
        "mnemonic": "Overwrought sounds like 'over-wrought,' indicating something that is overly complicated or someone who is overly anxious.",
        "visual_representation": "Picture someone pacing back and forth, overwhelmed with worry, symbolizing being overwrought.",
        "example_sentence": "She became overwrought with worry when her son didn't come home on time."
    },
    {
        "word": "Polygamist",
        "part_of_speech": "Noun",
        "definition": "A person who has more than one spouse at the same time.",
        "hindi_meaning": "बहुविवाही, बहुपत्नीधारी",
        "mnemonic": "Polygamist sounds like 'poly-gamist,' with 'poly' meaning many and 'gamy' referring to marriage.",
        "visual_representation": "Picture a man with multiple wedding rings, symbolizing a polygamist.",
        "example_sentence": "In some cultures, polygamy is practiced, and a polygamist may have several wives."
    },
    {
        "word": "Retrospective",
        "part_of_speech": "Adjective / Noun",
        "definition": "(Adjective) Looking back on or dealing with past events or situations; (Noun) An exhibition or compilation showing the development of an artist's work over time.",
        "hindi_meaning": "भूतकालिक, पूर्वदृष्टि",
        "mnemonic": "Retrospective sounds like 'retro-spective,' indicating looking back in time (retro) with perspective.",
        "visual_representation": "Picture someone reflecting on old photographs or an artist’s past works displayed in a gallery, symbolizing retrospection.",
        "example_sentence": "The museum hosted a retrospective of the artist's work, showcasing pieces from his entire career."
    },
    {
        "word": "Spate",
        "part_of_speech": "Noun",
        "definition": "A large number of similar things or events occurring in quick succession; a sudden flood in a river.",
        "hindi_meaning": "बड़ी संख्या, बाढ़",
        "mnemonic": "Spate sounds like 'spread,' indicating a sudden rush or outpouring of events or things.",
        "visual_representation": "Picture a river suddenly overflowing its banks, or a sudden influx of similar events, symbolizing a spate.",
        "example_sentence": "The city has experienced a spate of burglaries in recent weeks."
    },
    {
        "word": "Travesty",
        "part_of_speech": "Noun / Verb",
        "definition": "(Noun) A false, absurd, or distorted representation of something; (Verb) To represent in a false or distorted way.",
        "hindi_meaning": "विकृत रूप, भद्दी नक़ल",
        "mnemonic": "Travesty sounds like 'trick-vesty,' as in a distorted or twisted version of something.",
        "visual_representation": "Picture a courtroom scene where justice is being mocked or distorted, symbolizing a travesty.",
        "example_sentence": "The trial was a travesty of justice, with the verdict being predetermined."
    },
    {
        "word": "Vulnerable",
        "part_of_speech": "Adjective",
        "definition": "Susceptible to physical or emotional attack or harm.",
        "hindi_meaning": "असुरक्षित, संवेदनशील",
        "mnemonic": "Vulnerable sounds like 'vulner-able,' indicating someone who is open or susceptible to being hurt.",
        "visual_representation": "Picture a small child standing alone, exposed to the elements, symbolizing vulnerability.",
        "example_sentence": "The elderly are often more vulnerable to illnesses during the winter months."
    }
]
