[
    {
        "word": "Amnesia",
        "part_of_speech": "Noun",
        "definition": "A partial or total loss of memory.",
        "hindi_meaning": "स्मृतिलोप, भूलने की बीमारी",
        "mnemonic": "Amnesia sounds like 'a-mind-gone-sia,' indicating a condition where the memory is lost.",
        "visual_representation": "Picture a person struggling to remember familiar faces or events, symbolizing amnesia.",
        "example_sentence": "After the accident, he suffered from amnesia and couldn't recall anything about his past."
    },
    {
        "word": "Barterer",
        "part_of_sech": "Noun",
        "definition": "A person who exchanges goods or services for other goods or services without using money.",
        "hindi_meaning": "वस्तु-विनिमय करने वाला",
        "mnemonic": "Barterer sounds like 'barter-er,' someone who barters or trades goods without money.",
        "visual_representation": "Picture two people exchanging goods directly, like food for tools, symbolizing a barterer.",
        "example_sentence": "The barterer traded his fresh produce for handmade clothes."
    },
    {
        "word": "Colander",
        "part_of_speech": "Noun",
        "definition": "A perforated bowl used to strain off liquid from food, especially after cooking.",
        "hindi_meaning": "छलनी, छन्नी",
        "mnemonic": "Colander sounds like 'coal-ender,' as if draining water like filtering out coal from water.",
        "visual_representation": "Picture a bowl with holes, used to drain water from cooked pasta, symbolizing a colander.",
        "example_sentence": "After boiling the vegetables, she poured them into a colander to drain the water."
    },
    {
        "word": "Dismember",
        "part_of_speech": "Verb",
        "definition": "To cut off the limbs of a person or animal; to divide into parts.",
        "hindi_meaning": "अंग-भंग करना, टुकड़े करना",
        "mnemonic": "Dismember sounds like 'dis-member,' as in taking apart the members (limbs) of something.",
        "visual_representation": "Picture a butcher cutting apart a large piece of meat, symbolizing dismemberment.",
        "example_sentence": "The criminal dismembered the body to hide the evidence."
    },
    {
        "word": "Exegesis",
        "part_of_speech": "Noun",
        "definition": "Critical explanation or interpretation of a text, especially of scripture.",
        "hindi_meaning": "व्याख्या, विवेचना",
        "mnemonic": "Exegesis sounds like 'exe-get-sis,' as in extracting or explaining the meaning of a text.",
        "visual_representation": "Picture a scholar deeply studying and interpreting an ancient manuscript, symbolizing exegesis.",
        "example_sentence": "The professor's exegesis of the biblical text revealed new insights into its meaning."
    },
    {
        "word": "Fervid",
        "part_of_speech": "Adjective",
        "definition": "Intensely enthusiastic or passionate, especially to an excessive degree.",
        "hindi_meaning": "अत्यंत उत्साही, उग्र",
        "mnemonic": "Fervid sounds like 'fur-vid,' as in someone with a furiously vivid passion or enthusiasm.",
        "visual_representation": "Picture a passionate speaker on stage, full of energy and enthusiasm, symbolizing fervid.",
        "example_sentence": "Her fervid support for the cause inspired others to join the movement."
    },
    {
        "word": "Gloss Over",
        "part_of_speech": "Verb",
        "definition": "To treat or describe something in a way that avoids its obvious problems; to try to conceal or minimize something.",
        "hindi_meaning": "नजरअंदाज करना, बात को हल्के में लेना",
        "mnemonic": "Gloss Over sounds like 'gloss-coat,' as in putting a shiny coat to hide flaws.",
        "visual_representation": "Picture someone quickly brushing over a crack in the wall with paint to hide it, symbolizing glossing over.",
        "example_sentence": "The report glossed over the critical issues and focused only on the positives."
    },
    {
        "word": "Infinitesimal",
        "part_of_speech": "Adjective",
        "definition": "Extremely small; immeasurably or incalculably minute.",
        "hindi_meaning": "अति सूक्ष्म, नगण्य",
        "mnemonic": "Infinitesimal sounds like 'infinite-small,' indicating something so small it's almost immeasurable.",
        "visual_representation": "Picture a tiny speck of dust barely visible to the eye, symbolizing something infinitesimal.",
        "example_sentence": "The error in the calculation was infinitesimal, hardly affecting the final result."
    },
    {
        "word": "Leaven",
        "part_of_speech": "Noun / Verb",
        "definition": "(Noun) A substance, typically yeast, used to make dough rise; (Verb) To cause to rise or expand by adding a leavening agent; to modify or transform something for the better.",
        "hindi_meaning": "खमीर, उठाने वाला पदार्थ; सुधारना",
        "mnemonic": "Leaven sounds like 'leave-in,' as in leaving yeast in dough to rise.",
        "visual_representation": "Picture dough rising and expanding as it bakes, symbolizing leavening.",
        "example_sentence": "A sense of humor leavened the serious discussion, making it more enjoyable."
    },
    {
        "word": "Musky",
        "part_of_speech": "Adjective",
        "definition": "Having the odor of musk, which is a strong, earthy, and often pungent scent.",
        "hindi_meaning": "कस्तूरी जैसी गंध वाला, गाढ़ी खुशबू वाला",
        "mnemonic": "Musky sounds like 'musk-y,' indicating something that smells like musk.",
        "visual_representation": "Picture a bottle of cologne with a strong, earthy scent, symbolizing muskiness.",
        "example_sentence": "The room was filled with the musky scent of the old leather furniture."
    },
    {
        "word": "Obviate",
        "part_of_speech": "Verb",
        "definition": "To remove (a need or difficulty); to avoid or prevent.",
        "hindi_meaning": "टालना, रोकना",
        "mnemonic": "Obviate sounds like 'obvious-ate,' as in making something unnecessary or obvious to avoid.",
        "visual_representation": "Picture someone putting up a sign to prevent people from entering a dangerous area, symbolizing obviating danger.",
        "example_sentence": "The new medical treatment obviates the need for surgery."
    },
    {
        "word": "Poignancy",
        "part_of_speech": "Noun",
        "definition": "The quality of evoking a keen sense of sadness or regret.",
        "hindi_meaning": "मार्मिकता, गहनता",
        "mnemonic": "Poignancy sounds like 'point-gnancy,' as if something is sharply affecting the emotions.",
        "visual_representation": "Picture a touching scene from a movie that brings tears to your eyes, symbolizing poignancy.",
        "example_sentence": "The poignancy of the farewell speech moved everyone to tears."
    },
    {
        "word": "Retribution",
        "part_of_speech": "Noun",
        "definition": "Punishment inflicted on someone as vengeance for a wrong or criminal act.",
        "hindi_meaning": "प्रतिशोध, बदला",
        "mnemonic": "Retribution sounds like 're-tribute-ion,' as in paying back for a wrong done.",
        "visual_representation": "Picture someone seeking justice for a wrong done to them, symbolizing retribution.",
        "example_sentence": "The community demanded retribution for the crimes committed against them."
    },
    {
        "word": "Sparse",
        "part_of_speech": "Adjective",
        "definition": "Thinly dispersed or scattered; not dense or plentiful.",
        "hindi_meaning": "विरल, बिखरा हुआ",
        "mnemonic": "Sparse sounds like 'spar-sely,' as in something sparsely spread out.",
        "visual_representation": "Picture a few trees scattered across a vast, open field, symbolizing sparsity.",
        "example_sentence": "The vegetation in the desert is sparse, with only a few hardy plants."
    },
    {
        "word": "Transgression",
        "part_of_speech": "Noun",
        "definition": "An act that goes against a law, rule, or code of conduct; an offense.",
        "hindi_meaning": "उल्लंघन, अपराध",
        "mnemonic": "Transgression sounds like 'trans-aggression,' indicating stepping over or crossing the line of acceptable behavior.",
        "visual_representation": "Picture someone crossing a boundary marked 'no trespassing,' symbolizing a transgression.",
        "example_sentence": "The student's transgression of the school rules led to his suspension."
    },
    {
        "word": "Venom",
        "part_of_speech": "Noun",
        "definition": "A poisonous substance secreted by animals such as snakes, spiders, and scorpions; extreme malice or bitterness in someone's attitude, speech, or actions.",
        "hindi_meaning": "विष, ज़हर",
        "mnemonic": "Venom sounds like 've-nom,' as in a dangerous substance that can cause harm.",
        "visual_representation": "Picture a snake ready to strike, with venom dripping from its fangs, symbolizing venom.",
        "example_sentence": "The venom of the cobra is potent enough to kill a human."
    }
]
