[
    {
        "word": "Ameliorate",
        "part_of_speech": "Verb",
        "definition": "To make (something bad or unsatisfactory) better.",
        "hindi_meaning": "सुधारना, बेहतर बनाना",
        "mnemonic": "Ameliorate sounds like 'a-melior-rate,' as in improving or making something better.",
        "visual_representation": "Picture a nurse caring for a patient and making them feel better, symbolizing amelioration.",
        "example_sentence": "The new policy is designed to ameliorate the living conditions of the poor."
    },
    {
        "word": "Buxom",
        "part_of_speech": "Adjective",
        "definition": "(Of a woman) plump, with a full figure, and lively.",
        "hindi_meaning": "स्वस्थ और आकर्षक, भारी-भरकम",
        "mnemonic": "Buxom sounds like 'buck-some,' as in someone who is healthy, full-figured, and lively.",
        "visual_representation": "Picture a lively, cheerful woman with a full figure, symbolizing buxom.",
        "example_sentence": "The buxom hostess greeted everyone with a warm smile."
    },
    {
        "word": "Cognate",
        "part_of_speech": "Adjective / Noun",
        "definition": "Related by blood; having the same linguistic derivation as another; a word that is related in origin to another word.",
        "hindi_meaning": "समान मूल वाला, समान व्युत्पत्ति वाला",
        "mnemonic": "Cognate sounds like 'co-gnate,' indicating something that is co-related or derived from the same origin.",
        "visual_representation": "Picture two words in different languages that look and sound similar, symbolizing cognates.",
        "example_sentence": "The English word 'mother' and the German word 'Mutter' are cognates."
    },
    {
        "word": "Disinclination",
        "part_of_speech": "Noun",
        "definition": "A reluctance or lack of enthusiasm.",
        "hindi_meaning": "अनिच्छा, अरुचि",
        "mnemonic": "Disinclination sounds like 'dis-inclined,' as in not inclined or reluctant to do something.",
        "visual_representation": "Picture someone hesitating or avoiding a task they don’t want to do, symbolizing disinclination.",
        "example_sentence": "Her disinclination to attend the party was obvious by her excuses."
    },
    {
        "word": "Exceptionable",
        "part_of_speech": "Adjective",
        "definition": "Open to objection; causing disapproval or offense.",
        "hindi_meaning": "आपत्तिजनक, निंदनीय",
        "mnemonic": "Exceptionable sounds like 'exception-al,' as in something that is an exception or causes objection.",
        "visual_representation": "Picture a statement that causes a strong reaction or offense, symbolizing exceptionable.",
        "example_sentence": "The guest’s exceptionable remarks led to an awkward silence at the dinner table."
    },
    {
        "word": "Fanaticism",
        "part_of_speech": "Noun",
        "definition": "The quality of being fanatical; excessive zeal or obsessive enthusiasm.",
        "hindi_meaning": "उग्रता, अंधभक्ति",
        "mnemonic": "Fanaticism sounds like 'fan-aticism,' indicating extreme devotion or obsession, like a fan.",
        "visual_representation": "Picture someone passionately supporting a cause to the point of obsession, symbolizing fanaticism.",
        "example_sentence": "His fanaticism about fitness led him to work out five hours a day."
    },
    {
        "word": "Grove",
        "part_of_speech": "Noun",
        "definition": "A small group of trees.",
        "hindi_meaning": "बाग, उपवन",
        "mnemonic": "Grove sounds like 'grow-ve,' as in a place where trees grow together.",
        "visual_representation": "Picture a peaceful area with a small cluster of trees, symbolizing a grove.",
        "example_sentence": "They took a leisurely walk through the quiet grove."
    },
    {
        "word": "Inexorable",
        "part_of_speech": "Adjective",
        "definition": "Impossible to stop or prevent; relentless.",
        "hindi_meaning": "अटल, अनवरत",
        "mnemonic": "Inexorable sounds like 'in-exit-able,' as in something that cannot be exited or stopped.",
        "visual_representation": "Picture a powerful force, like a glacier, moving steadily and unstoppably forward, symbolizing inexorability.",
        "example_sentence": "The inexorable march of time cannot be halted."
    },
    {
        "word": "Lampoon",
        "part_of_speech": "Verb / Noun",
        "definition": "To publicly criticize (someone or something) by using ridicule, irony, or sarcasm; a speech or text that criticizes someone in this way.",
        "hindi_meaning": "उपहास करना, व्यंग्य लेख",
        "mnemonic": "Lampoon sounds like 'lamp-on,' as if shining a harsh light (lamp) on someone’s faults to mock them.",
        "visual_representation": "Picture a satirical cartoon mocking a politician, symbolizing a lampoon.",
        "example_sentence": "The comedian's show was a hilarious lampoon of the latest trends in pop culture."
    },
    {
        "word": "Multilingual",
        "part_of_speech": "Adjective",
        "definition": "Speaking several languages.",
        "hindi_meaning": "बहुभाषी, कई भाषाओं वाला",
        "mnemonic": "Multilingual sounds like 'multi-lingual,' indicating someone who can speak multiple languages.",
        "visual_representation": "Picture someone speaking different languages to different groups of people, symbolizing multilingualism.",
        "example_sentence": "Being multilingual, she easily communicated with people from various countries."
    },
    {
        "word": "Ornithologist",
        "part_of_speech": "Noun",
        "definition": "A person who studies or is an expert in birds.",
        "hindi_meaning": "पक्षी विज्ञानी",
        "mnemonic": "Ornithologist sounds like 'ornith-o-logist,' with 'ornitho' relating to birds, indicating a bird expert.",
        "visual_representation": "Picture a scientist observing birds in the wild, symbolizing an ornithologist.",
        "example_sentence": "The ornithologist spent years studying the migration patterns of Arctic birds."
    },
    {
        "word": "Pliant",
        "part_of_speech": "Adjective",
        "definition": "Easily bent or flexible; easily influenced.",
        "hindi_meaning": "लचीला, विनम्र",
        "mnemonic": "Pliant sounds like 'pliant-ant,' as in an ant that is easily bent or moved.",
        "visual_representation": "Picture a flexible branch that bends easily without breaking, symbolizing pliant.",
        "example_sentence": "The pliant material was perfect for crafting delicate sculptures."
    },
    {
        "word": "Retaliation",
        "part_of_speech": "Noun",
        "definition": "The action of returning a military attack; counterattack; revenge.",
        "hindi_meaning": "प्रतिशोध, बदला",
        "mnemonic": "Retaliation sounds like 're-tali-ation,' as in responding to a wrong with a counter-action.",
        "visual_representation": "Picture someone striking back after being hit, symbolizing retaliation.",
        "example_sentence": "The country's retaliation was swift after the surprise attack."
    },
    {
        "word": "Sonorous",
        "part_of_speech": "Adjective",
        "definition": "(Of a person's voice or other sound) imposingly deep and full.",
        "hindi_meaning": "गूंजने वाला, मधुर ध्वनि वाला",
        "mnemonic": "Sonorous sounds like 'so-noise-ous,' indicating a sound that is rich, deep, and resonant.",
        "visual_representation": "Picture a deep, rich voice echoing in a large hall, symbolizing sonorousness.",
        "example_sentence": "The sonorous voice of the opera singer filled the auditorium."
    },
    {
        "word": "Title",
        "part_of_speech": "Noun / Verb",
        "definition": "The name of a book, composition, or other artistic work; a name that describes someone's position or job; to give a name or title to a book, film, or other work.",
        "hindi_meaning": "शीर्षक, पद; शीर्षक देना",
        "mnemonic": "Title sounds like 'ti-tle,' as in the name or heading of something, or the role someone holds.",
        "visual_representation": "Picture a book cover with a prominent title or a nameplate indicating someone’s job title.",
        "example_sentence": "The title of the book intrigued readers and drew them in."
    },
    {
        "word": "Viscous",
        "part_of_speech": "Adjective",
        "definition": "Having a thick, sticky consistency between solid and liquid; having a high viscosity.",
        "hindi_meaning": "चिपचिपा, गाढ़ा",
        "mnemonic": "Viscous sounds like 'vis-cus,' indicating something thick and sticky, like syrup.",
        "visual_representation": "Picture honey slowly dripping from a spoon, symbolizing viscosity.",
        "example_sentence": "The viscous lava flowed slowly down the side of the volcano."
    }
]
