[
    {
        "word": "Alimentary",
        "part_of_speech": "Adjective",
        "definition": "Relating to nourishment or sustenance.",
        "hindi_meaning": "पोषण संबंधी, आहार संबंधी",
        "mnemonic": "Alimentary sounds like 'aliment-ary,' indicating something related to food or nourishment.",
        "visual_representation": "Picture a healthy, balanced meal that provides all the nutrients needed, symbolizing something alimentary.",
        "example_sentence": "The doctor advised her to focus on an alimentary diet to improve her health."
    },
    {
        "word": "Brittle",
        "part_of_speech": "Adjective",
        "definition": "Hard but liable to break or shatter easily.",
        "hindi_meaning": "भंगुर, टूटने वाला",
        "mnemonic": "Brittle sounds like 'break-tile,' indicating something that is fragile and can easily break.",
        "visual_representation": "Picture a dry, thin piece of glass that shatters with a slight touch, symbolizing brittleness.",
        "example_sentence": "The brittle bones of the elderly patient were prone to fractures."
    },
    {
        "word": "Clamber",
        "part_of_speech": "Verb",
        "definition": "To climb or move in an awkward and laborious way, typically using both hands and feet.",
        "hindi_meaning": "चढ़ाई करना, मुश्किल से चढ़ना",
        "mnemonic": "Clamber sounds like 'clam-ber,' as if clinging onto something to climb with difficulty.",
        "visual_representation": "Imagine someone struggling to climb a steep, rocky hillside, symbolizing clambering.",
        "example_sentence": "The children clambered over the rocks to reach the top of the hill."
    },
    {
        "word": "Dexterous",
        "part_of_speech": "Adjective",
        "definition": "Showing or having skill, especially with the hands.",
        "hindi_meaning": "कुशल, निपुण",
        "mnemonic": "Dexterous sounds like 'dexter-hand-ous,' indicating skillful use of the hands.",
        "visual_representation": "Picture a magician performing intricate tricks with cards, symbolizing dexterity.",
        "example_sentence": "The surgeon’s dexterous hands made the complex operation a success."
    },
    {
        "word": "Escapade",
        "part_of_speech": "Noun",
        "definition": "An act or incident involving excitement, daring, or adventure.",
        "hindi_meaning": "साहसिक कार्य, रोमांचक घटना",
        "mnemonic": "Escapade sounds like 'escape-ade,' indicating a daring or adventurous escape or activity.",
        "visual_representation": "Picture a group of friends sneaking out at night for an adventurous escapade, symbolizing a daring adventure.",
        "example_sentence": "Their weekend escapade to the mountains was filled with unexpected thrills."
    },
    {
        "word": "Fray",
        "part_of_speech": "Noun / Verb",
        "definition": "A situation of intense activity, typically one incorporating an element of aggression or competition; to become worn at the edge, typically through constant rubbing.",
        "hindi_meaning": "झगड़ा, लड़ाई; घिसना",
        "mnemonic": "Fray sounds like 'fray-ay,' as if something is getting frayed or there’s a fracas.",
        "visual_representation": "Picture a rope that is starting to unravel and wear out, symbolizing something frayed, or a heated argument, symbolizing a fray.",
        "example_sentence": "The debate quickly turned into a heated fray between the two candidates."
    },
    {
        "word": "Graduated",
        "part_of_speech": "Adjective",
        "definition": "Arranged in a series or according to a scale; marked at intervals (as on a thermometer or ruler).",
        "hindi_meaning": "क्रमिक, क्रमबद्ध; मापांकित",
        "mnemonic": "Graduated sounds like 'grad-uated,' indicating something that progresses in steps or stages.",
        "visual_representation": "Picture a measuring cup with lines indicating different levels, symbolizing something graduated.",
        "example_sentence": "The beaker was graduated in milliliters to measure the precise amount of liquid."
    },
    {
        "word": "Hermitage",
        "part_of_speech": "Noun",
        "definition": "The dwelling of a hermit, especially when small and remote.",
        "hindi_meaning": "आश्रम, एकांतवास",
        "mnemonic": "Hermitage sounds like 'hermit-age,' indicating a secluded place where a hermit lives.",
        "visual_representation": "Imagine a small, isolated cabin in the woods where someone lives alone, symbolizing a hermitage.",
        "example_sentence": "The monk lived in a hermitage deep in the mountains, far from civilization."
    },
    {
        "word": "Indices",
        "part_of_speech": "Noun (plural of index)",
        "definition": "An alphabetical list of names, subjects, etc., with references to the places where they occur, typically found at the end of a book; indicators or measures of something.",
        "hindi_meaning": "सूचकांक, संकेतक",
        "mnemonic": "Indices sounds like 'in-dices,' indicating points or references in a list.",
        "visual_representation": "Picture the back of a textbook where topics are listed with page numbers, symbolizing indices.",
        "example_sentence": "The indices of the economic report showed a decline in consumer confidence."
    },
    {
        "word": "Legend",
        "part_of_speech": "Noun",
        "definition": "A traditional story sometimes popularly regarded as historical but not authenticated; an extremely famous or notorious person, especially in a particular field.",
        "hindi_meaning": "दंतकथा, किंवदंती; प्रसिद्ध व्यक्ति",
        "mnemonic": "Legend sounds like 'leg-end,' indicating someone or something that stands out in history.",
        "visual_representation": "Imagine a famous hero whose stories are told for generations, symbolizing a legend.",
        "example_sentence": "According to legend, the hidden treasure lies buried somewhere in the forest."
    },
    {
        "word": "Monastic",
        "part_of_speech": "Adjective",
        "definition": "Relating to monks, nuns, or others living under religious vows, or the buildings in which they live; resembling a monk's life in solitude or asceticism.",
        "hindi_meaning": "मठ संबंधी, संन्यासी जैसा",
        "mnemonic": "Monastic sounds like 'monk-astic,' indicating a lifestyle or environment similar to that of monks.",
        "visual_representation": "Picture a quiet, secluded monastery where monks live a simple, disciplined life, symbolizing a monastic lifestyle.",
        "example_sentence": "He led a monastic life, devoted to prayer and meditation."
    },
    {
        "word": "Oblivious",
        "part_of_speech": "Adjective",
        "definition": "Not aware of or not concerned about what is happening around one.",
        "hindi_meaning": "अनजान, बेखबर",
        "mnemonic": "Oblivious sounds like 'ob-live-ious,' as if someone is living in their own world, unaware of their surroundings.",
        "visual_representation": "Picture someone walking down the street with headphones on, completely unaware of the busy traffic, symbolizing obliviousness.",
        "example_sentence": "She was oblivious to the fact that everyone was staring at her unusual outfit."
    },
    {
        "word": "Piety",
        "part_of_speech": "Noun",
        "definition": "The quality of being religious or reverent.",
        "hindi_meaning": "भक्ति, धर्मपरायणता",
        "mnemonic": "Piety sounds like 'pie-ety,' as if someone is so devoted that they see religious reverence in everything, even a pie.",
        "visual_representation": "Picture someone praying with deep devotion, symbolizing piety.",
        "example_sentence": "His piety was evident in the way he lived his life, always adhering to his religious beliefs."
    },
    {
        "word": "Repulsion",
        "part_of_speech": "Noun",
        "definition": "A feeling of intense distaste or disgust; the force by which one object drives another away.",
        "hindi_meaning": "घृणा, विकर्षण",
        "mnemonic": "Repulsion sounds like 're-pulse-ion,' indicating a strong feeling of pushing away or rejecting something.",
        "visual_representation": "Imagine someone recoiling from a foul smell, symbolizing repulsion.",
        "example_sentence": "The idea of eating raw meat filled her with repulsion."
    },
    {
        "word": "Slough",
        "part_of_speech": "Verb / Noun",
        "definition": "To shed or remove (a layer of dead skin); a swamp or situation characterized by lack of progress or activity.",
        "hindi_meaning": "उतारना, छोड़ना; दलदल",
        "mnemonic": "Slough sounds like 'sluff,' as if something is being sloughed off or discarded.",
        "visual_representation": "Picture a snake shedding its old skin, symbolizing the process of sloughing off.",
        "example_sentence": "The company managed to slough off its old, unproductive divisions to focus on new opportunities."
    },
    {
        "word": "Turpitude",
        "part_of_speech": "Noun",
        "definition": "Depravity; wickedness.",
        "hindi_meaning": "दुष्टता, नीचता",
        "mnemonic": "Turpitude sounds like 'turd-pi-tude,' indicating a low, base, or depraved state of behavior.",
        "visual_representation": "Imagine someone engaging in extremely immoral actions, symbolizing turpitude.",
        "example_sentence": "The judge condemned the criminal's actions as acts of moral turpitude."
    },
    {
        "word": "Vaporize",
        "part_of_speech": "Verb",
        "definition": "To convert or be converted into vapor; to cause to disappear or vanish.",
        "hindi_meaning": "वाष्प बनाना, गायब करना",
        "mnemonic": "Vaporize sounds like 'vapor-rise,' indicating turning something into vapor or making it disappear.",
        "visual_representation": "Picture water boiling and turning into steam, symbolizing vaporization.",
        "example_sentence": "The intense heat of the sun caused the water in the shallow puddles to vaporize quickly."
    }
]
