[
    {
        "word": "Analgesic",
        "part_of_speech": "Noun / Adjective",
        "definition": "(Noun) A drug or substance that relieves pain; (Adjective) Relating to the relief of pain.",
        "hindi_meaning": "दर्द निवारक, पीड़ा को हरने वाला",
        "mnemonic": "Analgesic sounds like 'anal-gesic,' as in something that takes away pain (think of 'an' as removing and 'algesic' as pain).",
        "visual_representation": "Picture a person taking a pill to relieve a headache, symbolizing an analgesic.",
        "example_sentence": "The doctor prescribed an analgesic to help with the patient's back pain."
    },
    {
        "word": "Bereft",
        "part_of_speech": "Adjective",
        "definition": "Deprived of or lacking something, especially a non-material asset; feeling great loss.",
        "hindi_meaning": "वंचित, शोकाकुल",
        "mnemonic": "Bereft sounds like 'be-left,' as in being left without something important.",
        "visual_representation": "Picture someone alone and grieving after losing a loved one, symbolizing bereavement.",
        "example_sentence": "She felt utterly bereft after the sudden death of her husband."
    },
    {
        "word": "Commandeer",
        "part_of_speech": "Verb",
        "definition": "To officially take possession or control of something, especially for military purposes.",
        "hindi_meaning": "अधिग्रहण करना, जबरदस्ती लेना",
        "mnemonic": "Commandeer sounds like 'command-ear,' as in taking control of something by command.",
        "visual_representation": "Picture soldiers taking over a civilian vehicle for military use, symbolizing commandeering.",
        "example_sentence": "The soldiers commandeered the vehicle to transport supplies to the front line."
    },
    {
        "word": "Dissection",
        "part_of_speech": "Noun",
        "definition": "The action of cutting something apart to study its internal parts; a detailed analysis or examination.",
        "hindi_meaning": "विच्छेदन, सूक्ष्म विश्लेषण",
        "mnemonic": "Dissection sounds like 'dis-section,' as in taking sections apart for study.",
        "visual_representation": "Picture a biology class where students are cutting open a frog to study its organs, symbolizing dissection.",
        "example_sentence": "The dissection of the frog helped the students understand its anatomy."
    },
    {
        "word": "Exorbitant",
        "part_of_speech": "Adjective",
        "definition": "(Of a price or amount charged) unreasonably high.",
        "hindi_meaning": "अत्यधिक, बहुत महंगा",
        "mnemonic": "Exorbitant sounds like 'ex-orbit-ant,' as in prices that are out of orbit, or extremely high.",
        "visual_representation": "Picture a price tag with an outrageously high number, symbolizing exorbitant costs.",
        "example_sentence": "The hotel's exorbitant rates made it unaffordable for most travelers."
    },
    {
        "word": "Flippant",
        "part_of_speech": "Adjective",
        "definition": "Not showing a serious or respectful attitude; frivolous.",
        "hindi_meaning": "बेअदब, हल्का-फुल्का",
        "mnemonic": "Flippant sounds like 'flip-ant,' as in flipping an ant nonchalantly, indicating a lack of seriousness.",
        "visual_representation": "Picture someone making jokes during a serious meeting, symbolizing a flippant attitude.",
        "example_sentence": "His flippant remarks during the serious discussion were not appreciated."
    },
    {
        "word": "Gale",
        "part_of_speech": "Noun",
        "definition": "A very strong wind; a burst of sound, especially of laughter.",
        "hindi_meaning": "तेज़ हवा, बवंडर; हंसी का ज़ोरदार झोंका",
        "mnemonic": "Gale sounds like 'whale,' as in a powerful force like a whale, but in the form of wind or sound.",
        "visual_representation": "Picture trees bending and leaves flying as a powerful wind blows through, symbolizing a gale.",
        "example_sentence": "The gale-force winds knocked down trees and power lines across the town."
    },
    {
        "word": "Ingrate",
        "part_of_speech": "Noun",
        "definition": "An ungrateful person.",
        "hindi_meaning": "कृतघ्न व्यक्ति, एहसानफरामोश",
        "mnemonic": "Ingrate sounds like 'in-great,' but think of it as someone who does not appreciate or is not grateful.",
        "visual_representation": "Picture someone rejecting a gift with a scowl, symbolizing an ingrate.",
        "example_sentence": "Despite all they did for him, he remained an ingrate, never showing any gratitude."
    },
    {
        "word": "Liberator",
        "part_of_speech": "Noun",
        "definition": "A person who frees a person or place from imprisonment or oppression.",
        "hindi_meaning": "मुक्तिदाता, आज़ादी दिलाने वाला",
        "mnemonic": "Liberator sounds like 'liberate-or,' as in someone who liberates or frees others.",
        "visual_representation": "Picture a hero cutting the chains of prisoners, symbolizing a liberator.",
        "example_sentence": "The liberator was hailed as a hero for freeing the country from tyranny."
    },
    {
        "word": "Malaise",
        "part_of_speech": "Noun",
        "definition": "A general feeling of discomfort, illness, or unease whose exact cause is difficult to identify.",
        "hindi_meaning": "अस्वस्थता, बेचैनी",
        "mnemonic": "Malaise sounds like 'mal-ease,' as in feeling unwell or uneasy.",
        "visual_representation": "Picture someone sitting with their head in their hands, feeling unwell but not sure why, symbolizing malaise.",
        "example_sentence": "A sense of malaise hung over the community after the tragic event."
    },
    {
        "word": "Portent",
        "part_of_speech": "Noun",
        "definition": "A sign or warning that something, especially something momentous or calamitous, is likely to happen.",
        "hindi_meaning": "पूर्वसूचना, संकेत",
        "mnemonic": "Portent sounds like 'port-end,' as in a sign that something big is coming to an end or a major change is coming.",
        "visual_representation": "Picture dark clouds gathering before a storm, symbolizing a portent of bad weather.",
        "example_sentence": "The sudden drop in temperature was a portent of the storm to come."
    },
    {
        "word": "Rhapsodize",
        "part_of_speech": "Verb",
        "definition": "To speak or write about someone or something with great enthusiasm and delight.",
        "hindi_meaning": "प्रशंसा में गीत गाना, अत्यधिक उत्साह से बोलना",
        "mnemonic": "Rhapsodize sounds like 'rapsody-ize,' as in speaking like you're composing a rhapsody or a piece of enthusiastic praise.",
        "visual_representation": "Picture someone passionately praising a work of art, unable to contain their enthusiasm, symbolizing rhapsodizing.",
        "example_sentence": "She rhapsodized about the beauty of the sunset, describing it in vivid detail."
    },
    {
        "word": "Splice",
        "part_of_speech": "Verb / Noun",
        "definition": "(Verb) To join or connect (a rope or film) by intertwining or overlapping the ends; (Noun) A union of two things that have been spliced together.",
        "hindi_meaning": "जोड़ना, बांधना",
        "mnemonic": "Splice sounds like 'split-ice,' but think of it as bringing two pieces together rather than splitting.",
        "visual_representation": "Picture two ropes being carefully tied together to form a strong bond, symbolizing a splice.",
        "example_sentence": "The sailor spliced the broken rope to make it strong enough to use again."
    },
    {
        "word": "Turgid",
        "part_of_speech": "Adjective",
        "definition": "Swollen and distended or congested; (of language or style) tediously pompous or bombastic.",
        "hindi_meaning": "सूजा हुआ, भड़काऊ",
        "mnemonic": "Turgid sounds like 'tur-gid,' as in something swollen or puffed up.",
        "visual_representation": "Picture a river swollen with water after heavy rain, or overly complicated writing, symbolizing turgidity.",
        "example_sentence": "His turgid writing style made the novel difficult to read."
    }
]
