[
    {
        "word": "Allure",
        "part_of_speech": "Noun / Verb",
        "definition": "The quality of being powerfully and mysteriously attractive or fascinating; to attract or tempt by something flattering or desirable.",
        "hindi_meaning": "आकर्षण, लुभाना",
        "mnemonic": "Allure sounds like 'all-lure,' indicating something that lures or attracts everything around it.",
        "visual_representation": "Picture a beautiful, shimmering object that everyone is drawn to, symbolizing allure.",
        "example_sentence": "The allure of the bright city lights drew her away from her small hometown."
    },
    {
        "word": "Buffoonery",
        "part_of_speech": "Noun",
        "definition": "Behavior that is ridiculous but amusing; foolish or playful behavior.",
        "hindi_meaning": "मूर्खता, ढोंग",
        "mnemonic": "Buffoonery sounds like 'buffoon-ery,' indicating silly, clownish behavior.",
        "visual_representation": "Picture a clown performing exaggerated, silly antics to make people laugh, symbolizing buffoonery.",
        "example_sentence": "The comedian's buffoonery had the audience laughing throughout the entire show."
    },
    {
        "word": "Climactic",
        "part_of_speech": "Adjective",
        "definition": "Relating to or forming a climax; the most intense, exciting, or important point of something.",
        "hindi_meaning": "चरम, उत्कर्ष",
        "mnemonic": "Climactic sounds like 'climax-tic,' indicating the highest or most intense point in a story or event.",
        "visual_representation": "Picture the peak moment in a movie where everything comes together, symbolizing the climax.",
        "example_sentence": "The climactic battle scene in the movie left the audience on the edge of their seats."
    },
    {
        "word": "Discrepancy",
        "part_of_speech": "Noun",
        "definition": "A lack of compatibility or similarity between two or more facts.",
        "hindi_meaning": "असंगति, अंतर",
        "mnemonic": "Discrepancy sounds like 'dis-creep-ancy,' as if something doesn’t quite match or creeps away from being the same.",
        "visual_representation": "Picture two documents that should match, but have different numbers or details, symbolizing a discrepancy.",
        "example_sentence": "There was a significant discrepancy between the accounts of the two witnesses."
    },
    {
        "word": "Eulogy",
        "part_of_speech": "Noun",
        "definition": "A speech or piece of writing that praises someone or something highly, typically someone who has just died.",
        "hindi_meaning": "प्रशंसा, श्रद्धांजलि",
        "mnemonic": "Eulogy sounds like 'you-low-gy,' as in speaking highly of someone who has passed on.",
        "visual_representation": "Picture a person standing at a podium, delivering a heartfelt tribute at a funeral, symbolizing a eulogy.",
        "example_sentence": "She delivered a moving eulogy at her grandmother's funeral."
    },
    {
        "word": "Frustrate",
        "part_of_speech": "Verb",
        "definition": "To prevent (a plan or attempted action) from progressing, succeeding, or being fulfilled; to cause someone to feel upset or annoyed.",
        "hindi_meaning": "विफल करना, हताश करना",
        "mnemonic": "Frustrate sounds like 'frustrat-ed,' indicating the feeling of being blocked or hindered.",
        "visual_representation": "Picture someone trying repeatedly to solve a difficult problem but failing, symbolizing frustration.",
        "example_sentence": "The constant delays in the project began to frustrate the entire team."
    },
    {
        "word": "Gait",
        "part_of_speech": "Noun",
        "definition": "A person’s manner of walking.",
        "hindi_meaning": "चाल, चलने का तरीका",
        "mnemonic": "Gait sounds like 'gate,' as in the way you walk through a gate or door.",
        "visual_representation": "Picture someone walking with a distinctive stride, symbolizing their gait.",
        "example_sentence": "His confident gait made him stand out in the crowd."
    },
    {
        "word": "Indolent",
        "part_of_speech": "Adjective",
        "definition": "Wanting to avoid activity or exertion; lazy.",
        "hindi_meaning": "आलसी, सुस्त",
        "mnemonic": "Indolent sounds like 'in-dull-ent,' as if someone is dull or lazy in their actions.",
        "visual_representation": "Picture someone lounging on a couch all day, avoiding any work, symbolizing indolence.",
        "example_sentence": "The indolent student procrastinated on all his assignments."
    },
    {
        "word": "Languish",
        "part_of_speech": "Verb",
        "definition": "To lose or lack vitality; to grow weak or feeble; to suffer from being forced to remain in an unpleasant place or situation.",
        "hindi_meaning": "मुरझाना, कमजोर पड़ना",
        "mnemonic": "Languish sounds like 'lang-wish,' as if wishing for strength while becoming weaker.",
        "visual_representation": "Picture a plant wilting in the sun without water, symbolizing languishing.",
        "example_sentence": "The prisoner languished in jail for years before his case was finally reviewed."
    },
    {
        "word": "Moribund",
        "part_of_speech": "Adjective",
        "definition": "At the point of death; in terminal decline; lacking vitality or vigor.",
        "hindi_meaning": "मरणासन्न, समाप्तप्राय",
        "mnemonic": "Moribund sounds like 'more-rebound,' as if something needs a rebound because it’s near death or decline.",
        "visual_representation": "Picture a dying tree with only a few leaves left, symbolizing something moribund.",
        "example_sentence": "The moribund company was unable to recover from its financial losses."
    },
    {
        "word": "Outspoken",
        "part_of_speech": "Adjective",
        "definition": "Frank in stating one’s opinions, especially if they are critical or controversial.",
        "hindi_meaning": "बेबाक, स्पष्टवादी",
        "mnemonic": "Outspoken sounds like 'out-spoken,' indicating someone who speaks out boldly.",
        "visual_representation": "Picture someone speaking directly and confidently in a group, symbolizing outspokenness.",
        "example_sentence": "She was known for being outspoken and never hesitated to share her views."
    },
    {
        "word": "Pivotal",
        "part_of_speech": "Adjective",
        "definition": "Of crucial importance in relation to the development or success of something else.",
        "hindi_meaning": "महत्वपूर्ण, केंद्रबिंदु",
        "mnemonic": "Pivotal sounds like 'pivot-all,' indicating something that all other things turn or pivot around.",
        "visual_representation": "Picture a central point around which everything else revolves, symbolizing something pivotal.",
        "example_sentence": "The discovery of the vaccine was a pivotal moment in medical history."
    },
    {
        "word": "Resolution",
        "part_of_speech": "Noun",
        "definition": "A firm decision to do or not to do something; the action of solving a problem or dispute.",
        "hindi_meaning": "संकल्प, समाधान",
        "mnemonic": "Resolution sounds like 're-solution,' indicating the act of finding a solution or making a firm decision.",
        "visual_representation": "Picture someone determinedly crossing off goals on a list, symbolizing resolution.",
        "example_sentence": "She made a resolution to exercise more regularly this year."
    },
    {
        "word": "Sojourn",
        "part_of_speech": "Noun / Verb",
        "definition": "A temporary stay; to stay somewhere temporarily.",
        "hindi_meaning": "अस्थायी निवास, ठहराव",
        "mnemonic": "Sojourn sounds like 'so-journey,' indicating a brief stop or stay during a journey.",
        "visual_representation": "Picture a traveler resting at a small inn for a few days, symbolizing a sojourn.",
        "example_sentence": "Their sojourn in Paris was brief but filled with wonderful experiences."
    },
    {
        "word": "Tedious",
        "part_of_speech": "Adjective",
        "definition": "Too long, slow, or dull; tiresome or monotonous.",
        "hindi_meaning": "उबाऊ, थकाऊ",
        "mnemonic": "Tedious sounds like 'ted-dious,' as if something is so slow and boring it’s dull and tiring.",
        "visual_representation": "Picture someone yawning and struggling to stay awake while reading a long, boring report, symbolizing tediousness.",
        "example_sentence": "The tedious lecture made it hard for the students to stay focused."
    },
    {
        "word": "Voluminous",
        "part_of_speech": "Adjective",
        "definition": "Occupying or containing much space; large in volume, in particular.",
        "hindi_meaning": "विशाल, बड़े आकार का",
        "mnemonic": "Voluminous sounds like 'volume-us,' indicating something with a lot of volume or size.",
        "visual_representation": "Picture a thick, heavy book with hundreds of pages, symbolizing something voluminous.",
        "example_sentence": "The library had a voluminous collection of ancient manuscripts."
    }
]
