[
    {
        "word": "Amiable",
        "part_of_speech": "Adjective",
        "definition": "Having or displaying a friendly and pleasant manner.",
        "hindi_meaning": "मिलनसार, मित्रवत",
        "mnemonic": "Amiable sounds like 'am I able' to be friendly and kind? Yes!",
        "visual_representation": "Picture someone with a warm smile, greeting everyone cheerfully, symbolizing amiability.",
        "example_sentence": "The amiable shopkeeper always had a kind word for his customers."
    },
    {
        "word": "Balm",
        "part_of_speech": "Noun",
        "definition": "A fragrant ointment or preparation used to heal or soothe the skin; something that has a comforting, soothing, or restorative effect.",
        "hindi_meaning": "मरहम, शांति देने वाला",
        "mnemonic": "Balm sounds like 'calm,' indicating something that soothes or heals.",
        "visual_representation": "Picture someone applying a soothing ointment to their skin, symbolizing balm.",
        "example_sentence": "The cool breeze was a balm to the travelers after the scorching heat."
    },
    {
        "word": "Cohesion",
        "part_of_speech": "Noun",
        "definition": "The action or fact of forming a united whole; the sticking together of particles of the same substance.",
        "hindi_meaning": "एकता, जुड़ाव",
        "mnemonic": "Cohesion sounds like 'co-he-sion,' as in things 'co-' (together) and 'sion' (binding).",
        "visual_representation": "Picture a group of people holding hands in a circle, symbolizing unity and cohesion.",
        "example_sentence": "The team's cohesion was evident in how well they worked together."
    },
    {
        "word": "Disjointed",
        "part_of_speech": "Adjective",
        "definition": "Lacking a coherent sequence or connection; disconnected.",
        "hindi_meaning": "असंगत, बिखरा हुआ",
        "mnemonic": "Disjointed sounds like 'dis-joint-ed,' as if something has come apart at the joints.",
        "visual_representation": "Picture a puzzle with pieces scattered and not fitting together, symbolizing disjointedness.",
        "example_sentence": "The disjointed plot of the movie made it hard to follow the story."
    },
    {
        "word": "Excoriate",
        "part_of_speech": "Verb",
        "definition": "To criticize severely; to damage or remove part of the surface of (the skin).",
        "hindi_meaning": "कठोर आलोचना करना, खाल छीलना",
        "mnemonic": "Excoriate sounds like 'ex-core-iate,' as in attacking something to its core.",
        "visual_representation": "Picture a harsh critic tearing apart a book review, symbolizing excoriation.",
        "example_sentence": "The politician was excoriated by the press for his controversial remarks."
    },
    {
        "word": "Fecundity",
        "part_of_speech": "Noun",
        "definition": "The ability to produce an abundance of offspring or new growth; fertility.",
        "hindi_meaning": "उर्वरता, सृजनात्मकता",
        "mnemonic": "Fecundity sounds like 'fecund-city,' indicating a city full of life and growth.",
        "visual_representation": "Picture a lush, green field full of thriving plants, symbolizing fecundity.",
        "example_sentence": "The fecundity of the soil made it ideal for farming."
    },
    {
        "word": "Gamely",
        "part_of_speech": "Adverb",
        "definition": "In a brave, spirited way; with determination.",
        "hindi_meaning": "साहसपूर्वक, हिम्मत से",
        "mnemonic": "Gamely sounds like 'game-ly,' as in approaching challenges as if ready to play and win a game.",
        "visual_representation": "Picture a runner determinedly finishing a race despite an injury, symbolizing gamely behavior.",
        "example_sentence": "Despite the challenges, she gamely continued her work without complaint."
    },
    {
        "word": "Infer",
        "part_of_speech": "Verb",
        "definition": "To deduce or conclude information from evidence and reasoning rather than from explicit statements.",
        "hindi_meaning": "अनुमान लगाना, निष्कर्ष निकालना",
        "mnemonic": "Infer sounds like 'in-fur,' as in looking at fur to infer what kind of animal it is.",
        "visual_representation": "Picture someone piecing together clues to solve a mystery, symbolizing inference.",
        "example_sentence": "From her tone, I could infer that she was not happy with the decision."
    },
    {
        "word": "Luxuriant",
        "part_of_speech": "Adjective",
        "definition": "Rich and profuse in growth; lush.",
        "hindi_meaning": "घना, समृद्ध",
        "mnemonic": "Luxuriant sounds like 'luxury-ant,' as in something so rich and full, it feels like a luxury.",
        "visual_representation": "Picture a thick, green forest with abundant vegetation, symbolizing luxuriance.",
        "example_sentence": "The garden was filled with luxuriant vegetation and colorful flowers."
    },
    {
        "word": "Mural",
        "part_of_speech": "Noun",
        "definition": "A large painting or artwork done on a wall or ceiling.",
        "hindi_meaning": "भित्ति चित्र",
        "mnemonic": "Mural sounds like 'wall-art,' indicating a large painting on a wall.",
        "visual_representation": "Picture a vibrant painting covering the entire side of a building, symbolizing a mural.",
        "example_sentence": "The mural on the community center depicts the history of the neighborhood."
    },
    {
        "word": "Optician",
        "part_of_speech": "Noun",
        "definition": "A person qualified to make and supply eyeglasses and contact lenses for correction of vision.",
        "hindi_meaning": "चश्मा बनाने वाला, नेत्र-विशेषज्ञ",
        "mnemonic": "Optician sounds like 'optic-ian,' as in someone who works with optics (glasses and lenses).",
        "visual_representation": "Picture a professional fitting glasses for a customer, symbolizing an optician.",
        "example_sentence": "The optician adjusted my glasses to fit perfectly."
    },
    {
        "word": "Plummet",
        "part_of_speech": "Verb",
        "definition": "To fall or drop straight down at high speed.",
        "hindi_meaning": "तेजी से गिरना, नीचे गिरना",
        "mnemonic": "Plummet sounds like 'plum-met,' as in something dropping like a heavy plum.",
        "visual_representation": "Picture a rock falling off a cliff, symbolizing plummeting.",
        "example_sentence": "The stock prices plummeted after the company's earnings report was released."
    },
    {
        "word": "Retiring",
        "part_of_speech": "Adjective",
        "definition": "Shy and fond of being on one's own; reserved.",
        "hindi_meaning": "शर्मीला, संकोची",
        "mnemonic": "Retiring sounds like 're-tire-ing,' as in someone who tires of social situations and prefers being alone.",
        "visual_representation": "Picture someone quietly reading a book alone at a party, symbolizing a retiring personality.",
        "example_sentence": "Despite his success, he was a quiet and retiring man who avoided the spotlight."
    },
    {
        "word": "Soporific",
        "part_of_speech": "Adjective / Noun",
        "definition": "Tending to induce drowsiness or sleep; a drug or other agent that induces sleep.",
        "hindi_meaning": "नींद लाने वाला, निद्राजनक",
        "mnemonic": "Soporific sounds like 'so-poor-ific,' as in something so boring it makes you sleepy.",
        "visual_representation": "Picture someone nodding off while reading a very dull book, symbolizing a soporific effect.",
        "example_sentence": "The professor's soporific lecture had half the class yawning within minutes."
    },
    {
        "word": "Totter",
        "part_of_speech": "Verb",
        "definition": "To move in a feeble or unsteady way; to be unstable.",
        "hindi_meaning": "डगमगाना, लड़खड़ाना",
        "mnemonic": "Totter sounds like 'toddler,' as in a toddler who totters as they learn to walk.",
        "visual_representation": "Picture someone wobbling as they try to walk on a narrow beam, symbolizing tottering.",
        "example_sentence": "The old man tottered across the room with the help of a cane."
    },
    {
        "word": "Vie",
        "part_of_speech": "Verb",
        "definition": "To compete eagerly with someone in order to do or achieve something.",
        "hindi_meaning": "प्रतिस्पर्धा करना, मुकाबला करना",
        "mnemonic": "Vie sounds like 'vibe,' as in competing to have the best vibe or energy.",
        "visual_representation": "Picture two athletes sprinting toward the finish line, each trying to outdo the other, symbolizing vying.",
        "example_sentence": "Several companies are vying for the contract to build the new bridge."
    }
]
