[
    {
        "word": "Alchemy",
        "part_of_speech": "Noun",
        "definition": "A medieval forerunner of chemistry, concerned with the transmutation of matter, particularly with attempts to convert base metals into gold or find a universal elixir; a process that is mysterious and magical.",
        "hindi_meaning": "रसायन शास्त्र, कीमियागरी",
        "mnemonic": "Alchemy sounds like 'all-chem-y,' as if combining all chemistry with magic and mystery.",
        "visual_representation": "Picture an ancient alchemist in a lab full of bubbling potions, trying to turn lead into gold, symbolizing alchemy.",
        "example_sentence": "The alchemy of their friendship turned everyday moments into something special."
    },
    {
        "word": "Breadth",
        "part_of_speech": "Noun",
        "definition": "The distance or measurement from side to side of something; width; wide range or extent.",
        "hindi_meaning": "चौड़ाई, विस्तार",
        "mnemonic": "Breadth sounds like 'breadth-width,' indicating the width or extent of something.",
        "visual_representation": "Imagine measuring the width of a large river, symbolizing breadth.",
        "example_sentence": "The breadth of his knowledge on the subject was impressive."
    },
    {
        "word": "Cistern",
        "part_of_speech": "Noun",
        "definition": "A tank for storing water, especially one supplying taps or as part of a flushing toilet.",
        "hindi_meaning": "जलाशय, पानी का टैंक",
        "mnemonic": "Cistern sounds like 'sis-turn,' indicating a container where water is stored or turns around.",
        "visual_representation": "Picture a large water tank used to collect rainwater, symbolizing a cistern.",
        "example_sentence": "The old farmhouse had a cistern in the backyard to collect rainwater for household use."
    },
    {
        "word": "Devise",
        "part_of_speech": "Verb",
        "definition": "To plan or invent (a complex procedure, system, or mechanism) by careful thought.",
        "hindi_meaning": "योजना बनाना, सोचकर तैयार करना",
        "mnemonic": "Devise sounds like 'device,' as if creating or coming up with a new device or plan.",
        "visual_representation": "Imagine an inventor sketching out plans for a new invention, symbolizing devising.",
        "example_sentence": "The engineers devised a new method for improving fuel efficiency."
    },
    {
        "word": "Erotic",
        "part_of_speech": "Adjective",
        "definition": "Relating to or tending to arouse sexual desire or excitement.",
        "hindi_meaning": "कामुक, उत्तेजक",
        "mnemonic": "Erotic sounds like 'erot-ic,' indicating something related to passion or sexual desire.",
        "visual_representation": "Picture a scene from a romantic movie that is sensually charged, symbolizing eroticism.",
        "example_sentence": "The novel contained several erotic passages that were considered scandalous at the time."
    },
    {
        "word": "Frantic",
        "part_of_speech": "Adjective",
        "definition": "Wild or distraught with fear, anxiety, or other emotion; conducted in a hurried, excited, or chaotic way.",
        "hindi_meaning": "व्याकुल, पागलपन भरा",
        "mnemonic": "Frantic sounds like 'frenzied,' indicating a state of intense and chaotic activity or emotion.",
        "visual_representation": "Picture someone running around in a panic, looking for their lost keys, symbolizing frantic behavior.",
        "example_sentence": "She made a frantic search for her missing passport just before her flight."
    },
    {
        "word": "Glower",
        "part_of_speech": "Verb / Noun",
        "definition": "To have an angry or sullen look on one's face; a scowl.",
        "hindi_meaning": "घूरना, कड़ी नज़र से देखना",
        "mnemonic": "Glower sounds like 'glow-er,' as if someone’s eyes are glowing with anger while staring.",
        "visual_representation": "Imagine someone giving a dark, intense stare, symbolizing a glower.",
        "example_sentence": "He glowered at the noisy neighbors who disturbed his sleep."
    },
    {
        "word": "Hilarity",
        "part_of_speech": "Noun",
        "definition": "Extreme amusement, especially when expressed by laughter.",
        "hindi_meaning": "उल्लास, हँसी-खुशी",
        "mnemonic": "Hilarity sounds like 'hilarious,' indicating something so funny that it causes laughter.",
        "visual_representation": "Picture a group of friends laughing uncontrollably at a funny joke, symbolizing hilarity.",
        "example_sentence": "The comedian’s jokes brought about much hilarity among the audience."
    },
    {
        "word": "Indentation",
        "part_of_speech": "Noun",
        "definition": "The action of indenting or the state of being indented; a deep recess or notch on the edge or surface of something.",
        "hindi_meaning": "खांचा, दाँतों वाला हिस्सा",
        "mnemonic": "Indentation sounds like 'in-dent,' indicating a notch or space set inward.",
        "visual_representation": "Picture a document with the first line of each paragraph set inwards, symbolizing indentation.",
        "example_sentence": "The indentation on the car’s surface was caused by a fallen branch."
    },
    {
        "word": "Lachrymose",
        "part_of_speech": "Adjective",
        "definition": "Tearful or given to weeping; inducing tears.",
        "hindi_meaning": "आंसू भरा, रोने वाला",
        "mnemonic": "Lachrymose sounds like 'lack-cry-most,' indicating someone who is very tearful or emotional.",
        "visual_representation": "Imagine someone watching a sad movie and crying, symbolizing lachrymose behavior.",
        "example_sentence": "The lachrymose film left everyone in the theater reaching for tissues."
    },
    {
        "word": "Molten",
        "part_of_speech": "Adjective",
        "definition": "(Especially of materials with a high melting point, such as metal and glass) liquefied by heat.",
        "hindi_meaning": "पिघला हुआ, द्रवित",
        "mnemonic": "Molten sounds like 'melt-en,' indicating something that has been melted by heat.",
        "visual_representation": "Picture hot, glowing lava flowing from a volcano, symbolizing molten rock.",
        "example_sentence": "The blacksmith poured the molten metal into a mold to create a new sword."
    },
    {
        "word": "Orthodox",
        "part_of_speech": "Adjective",
        "definition": "Conforming to what is generally or traditionally accepted as right or true; established and approved.",
        "hindi_meaning": "पारंपरिक, रूढ़िवादी",
        "mnemonic": "Orthodox sounds like 'ortho-docks,' as if something is solidly docked in tradition and standard practice.",
        "visual_representation": "Picture a religious ceremony being conducted exactly as it has been for centuries, symbolizing orthodoxy.",
        "example_sentence": "He followed orthodox medical practices and was wary of alternative treatments."
    },
    {
        "word": "Picaresque",
        "part_of_speech": "Adjective",
        "definition": "Relating to an episodic style of fiction dealing with the adventures of a rough and dishonest but appealing hero.",
        "hindi_meaning": "आवारा, घुमक्कड़ नायक से सम्बंधित",
        "mnemonic": "Picaresque sounds like 'pick-a-rescue,' indicating a rogue or mischievous hero who has many adventures.",
        "visual_representation": "Picture a charming rogue going from one adventure to another, always getting into and out of trouble, symbolizing a picaresque character.",
        "example_sentence": "The novel is a picaresque tale of a young thief who roams the countryside getting into mischief."
    },
    {
        "word": "Reprobate",
        "part_of_speech": "Noun / Adjective / Verb",
        "definition": "An unprincipled person (often used humorously or affectionately); a rogue.",
        "hindi_meaning": "दुष्ट, पथभ्रष्ट व्यक्ति",
        "mnemonic": "Reprobate sounds like 're-pro-bait,' as if someone is repeatedly bad and beyond redemption.",
        "visual_representation": "Imagine a lovable rogue who always finds himself in trouble but is hard to dislike, symbolizing a reprobate.",
        "example_sentence": "The old reprobate charmed everyone despite his questionable past."
    },
    {
        "word": "Slight",
        "part_of_speech": "Adjective / Noun / Verb",
        "definition": "Small in degree; inconsiderable; an insult caused by a failure to show someone proper respect or attention.",
        "hindi_meaning": "हल्का, तुच्छ; अपमान करना",
        "mnemonic": "Slight sounds like 'slim-light,' indicating something small or insignificant.",
        "visual_representation": "Picture someone giving a minor or dismissive gesture, symbolizing a slight.",
        "example_sentence": "She felt slighted when her contributions were ignored in the meeting."
    },
    {
        "word": "Turbulence",
        "part_of_speech": "Noun",
        "definition": "Violent or unsteady movement of air or water, or of some other fluid; conflict or confusion.",
        "hindi_meaning": "अशांति, हलचल",
        "mnemonic": "Turbulence sounds like 'turbo-lance,' as in a forceful, chaotic motion.",
        "visual_representation": "Picture a plane shaking violently in the sky, symbolizing turbulence.",
        "example_sentence": "The flight encountered severe turbulence, causing passengers to grip their seats tightly."
    },
    {
        "word": "Visionary",
        "part_of_speech": "Noun / Adjective",
        "definition": "A person with original ideas about what the future will or could be like; having or showing clear ideas about what should happen or be done in the future.",
        "hindi_meaning": "दूरदर्शी, कल्पनाशील व्यक्ति",
        "mnemonic": "Visionary sounds like 'vision-airy,' as in someone with airy, far-reaching visions or ideas.",
        "visual_representation": "Picture an inventor dreaming of futuristic technology, symbolizing visionary thinking.",
        "example_sentence": "The entrepreneur was a true visionary, always thinking years ahead of the competition."
    }
]
